[
    {
        "ID": "Jonathan EllisNationals",
        "name": "Jonathan Ellis",
        "meet": "Nationals",
        "event": "10000m",
        "thoughts": "I wanted it so bad and felt so mentally prepared, but my body had nothing. I made some major mistakes over the first six laps that made me very inefficient by making surges I didn't need to and letting people take my space, but my legs still just had nothing to give. ",
        "positives": "+ Got the experience of running at the National Championship meet\n+ Gave it my absolute best effort and was determined to run for All American and not just be a participant\n- I was extremely inefficient by surging up to 10th or 12th and then letting people take that space multiple times",
        "goal": "No. I wanted to be an All American, or at least make a really solid run at it and I wasn't even close. However, now that I know how my legs were on the day, I know that that was not realistic.",
        "turnpoint": "800m - Grant O'Connor took the pace down dramatically and I tried to get myself into a position where if a gap formed, I could go with\n3200m - I lost contact with the pack and tried my best to stick, but my legs had nothing\n~8k - I was dying and fighting for 19th with Owen Woo when I got lapped and tried to stick to the guy who lapped me. I lasted 1 lap and then died.",
        "attitude": "10",
        "effort": "9",
        "date": "1558993381288"
    },
    {
        "ID": "Justin VarineauGregory",
        "name": "Justin Varineau",
        "meet": "Gregory",
        "event": "5000m",
        "thoughts": "Definitely a step in the right direction. By no means am I satisfied with the time, but it's something good I can take into my two week break!",
        "positives": "+: I felt really good through 1k!\n+: Confidence. Though it backfired, I wasn't tentative.\n-: Not being more patient. Confidence is good, but patience is also good.",
        "goal": "Mostly. The goal of the race was to end the season on a high note and go into the XC season feeling confident. Though the race wasn't that impressive, the goal was achieved, and I'm ready for XC (after I realllllyyyyy soak in the two weeks off) ",
        "turnpoint": "Probably around 2k when I started feeling tired. The first 1.5k was awesome! I thought I was gonna PR...so I got a little impatient and moved up earlier than I should've.\nI don't think I reacted too well once 2k hit. I was mediocre mentally and let several groups pass me without making much effort to latch on. I could've definitely gotten a few more seconds just by trying to stick for one lap.",
        "attitude": "7",
        "effort": "7",
        "date": "1558131651900"
    },
    {
        "ID": "Caleb FergusonNCC Dr. Keeler Last Chance",
        "name": "Caleb Ferguson",
        "meet": "NCC Dr. Keeler Last Chance",
        "event": "Steeple",
        "thoughts": "I ran a very smart building race and it leaves me wanting a lot more. Made me more confident in my gears and how I can win in the middle, but I need more over the hurdles, I think more focus needs to be put on those.",
        "positives": "+ I learned something new about how I can attack the middle and still finish.\n+ I was confident and responding every time Wilkerson made a move.\n- My hurdles are still ass.",
        "goal": "My goal was primarily to qualify, but I also really wanted to break 9. I believe I accomplished the first one, but I feel like the energy is there for the second, just not the hurdling, but if that comes holy cow watch out.",
        "turnpoint": "Turning points were every time Brandon Wilkerson passed me, and then again when I decided to make my own proactive moves. I made all the right choices that I consciously perceived, but I think had I been a little more aware of the DIII guys around me I would've liked to go after the WASH U guys more. ",
        "attitude": "9",
        "effort": "9",
        "date": 1557794480081
    },
    {
        "ID": "Morrison IsmondConference  ",
        "name": "Morrison Ismond",
        "meet": "Conference  ",
        "event": "1500m",
        "thoughts": "It was a weird race being bubbled up for the first three laps. I mostly ran in lane two and three trying to get in good position to make a move up. The first 3 laps I was right were I was supposed to be with in striking distance. Started to move in that third lap a little bit getting ready to go. fourth lap came around and the first hundred I had no sprint in my step and nothing to give. No spark of energy that I know I poses when it comes to the four hundred. I just wasn't there. Finished to the best of my ability and was not overall happy in the slightest with my performance knowing I should be better than I'm. ",
        "positives": "I was in striking position looking to be the dark horse in that race. Position was decent besides running in lane two and three, but had to adapt to race. One thing to work on is getting stronger and realizing that I'm extremely gifted knowing that in time I will become a force to be reckoned with. Also have a better overall attitude about my race because I know it unintentionally rubs off on other people...=)",
        "goal": "My goal was to get the team a point and it was realistic and should have happened. ",
        "turnpoint": "Turning point was trying to go in the last lap and my body was giving me nothing to work with. Just finished with what I had... ",
        "attitude": "8",
        "effort": "10",
        "date": 1557794273340
    },
    {
        "ID": "Jack RandallDr. Keeler",
        "name": "Jack Randall",
        "meet": "Dr. Keeler",
        "event": "10000m",
        "thoughts": "A nice 10k PR! This was by and far the largest field I have ever been a part of and it was a blast. 48 guys large. Jacob and I found each other in the first 200m which was awesome. I led him for a bit, and we hooked up with favorite afro'd friend from Aquinas, Ganon Foley. He's a good dude, he tapped me on shoulder and offered to work with us. We obliged and clicked off 77s with him for a good chunk. After about a mile and a half, he got antsy and took off. That was not a move that Jacob or I wanted to make, so we said goodbye. We came through halfway at 16:07, which was right where I wanted to be. This was where Jacob took it from me, and he dropped the pace to 76s. Poifect. We started eating guys up in the second half. Every guy we past gave Jacob and I little more energy. Finally, with 6 to go, Jacob had had enough. He took off from me, dropping the pace even lower. I couldn't handle that at this point in the race. So I clung to the backs of the guys in front of me. My pace suffered a little bit, but not substantially. Eventually with three laps to go, I put in my final surge and went anaerobic. I believe I caught five or six guys in the last few laps, and put four away in the last 200m alone. It was a good finish, and I dipped just under 32:30 to run 32:29. A solid PR and a good race! ",
        "positives": "+Good PR\n+Good focus\n-staying focused and position-aware in the first half",
        "goal": "Absolutely! A good 10k PR!",
        "turnpoint": "At halfway there was a bit of a scrum when a guy dropped out and tripped a few guys up in the process. I lost contact with Jacob but was able to re-hookup with him after a lap.",
        "attitude": "10",
        "effort": "10",
        "date": 1557794480080
    },
    {
        "ID": "Caleb FergusonNCAA Track Outdoor National Championships",
        "name": "Caleb Ferguson",
        "meet": "NCAA Track Outdoor National Championships",
        "event": "Steeple",
        "thoughts": "Just really really sucks to not have any energy in a race like this. I was worried but I definitely thought I would bounce back or that I would be able to get through it anyway just like the week before. It was different though and it leaves me extremely disappointed and frustrated with a lot of things, because I feel it was largely out of my control how I felt. If you want to better understand what I mean by that you can come talk to me.",
        "positives": "+I put myself in it early and stayed engaged for the first half.\n+I learned something about how I need to prepare throughout the course of the season.\n-I felt helpless against what was happening and that is the worst feeling in the world.",
        "goal": "No, wanted to get through prelims and give myself a shot in finals. I do not think it was very realistic given the energy I was working with on the day.",
        "turnpoint": "I got out well and I even battled for a while in the middle. I made some good moves for position, but it was pretty hard from the start. My hurdles fell apart and that's when the running became near impossible to keep up. I couldn't have done much I don't think. It was too much to ask my body to dig that deep, while lacking energy, as many times as it has especially back to back weeks, because last week was the deepest I have ever gone in a steeple.",
        "attitude": "8",
        "effort": "8",
        "date": "1558920326345"
    },
    {
        "ID": "Caleb FergusonNCC Gregory Last Chance Qualifier",
        "name": "Caleb Ferguson",
        "meet": "NCC Gregory Last Chance Qualifier",
        "event": "Steeple",
        "thoughts": "I went really deep in this one. I definitely dug harder than I probably ever have before in a steeple chase. Strangely I just didn't have almost any energy after the second or third lap. With two laps to go it was as bad as it usually is with 200 to go but I had a new kind of desperation and determination. I wanted to go to nationals very very badly.",
        "positives": "+I dug deeper than I ever have physically in a steeple.\n+I still found a way to close decently hard.\n-I didn't run any faster and I didn't protect my space especially well.",
        "goal": "I wanted to run a PR and Qualify. Given my energy I really did everything I could. You always think that maybe there is something else that might've given me that last .4 or .5 to get there but I don't know what I could've done other than protect my space a little better.",
        "turnpoint": "When with a few laps to go I said screw how I am feeling I have to be the guy to go after Benkovsky because I need to go and track him down if I am going to qualify.\n\nI had to do that a couple times and I always chose to do that.",
        "attitude": "9",
        "effort": "10",
        "date": "1558459034090"
    },
    {
        "name": "William Terpstra",
        "event": "5000m",
        "meet": "Rhodes Invite",
        "thoughts": "I think the race went really well overall. I stayed with the middle pack and made the necessary moves throughout to move to where I wanted to be. I wish I had a bit more with 600m to go, because that's where I started to really feel fatigued.",
        "positives": "+) I passed when I needed to and generally made smart moves throughout the race.\n+) I PR'ed by 10 seconds.\n\nWork on finishing my race strong (this will come as I progress in training)",
        "goal": "Yes, I did what I needed to do and raced a solid 5k that I am proud of.",
        "attitude": "10",
        "effort": "9",
        "ID": "William TerpstraRhodes Invite",
        "date": 1557437882997
    },
    {
        "ID": "Micah MeindertsmaRhodes Invitational",
        "name": "Micah Meindertsma",
        "meet": "Rhodes Invitational",
        "event": "10000m",
        "thoughts": "The race went exactly as planned. I was able to work well with Vreeke and Noah. The pace was smooth and easy for the first half and then picked up quite a bit in the second half. We all negitave split by a lot and I gained a ton of confidence from the race. ",
        "positives": "I stayed on the train through most of the race and worked well with my teamates. I did not let myself get revolving doored or forced to do more work than I needed to. Still I need to work on haging on in the final parts of the race when the pace really starrs going. I need to build that strength. ",
        "goal": "Yes I did. I negitave split by over 30 seconds and gained confiedence from this race. ",
        "attitude": "10",
        "effort": "9",
        "date": 1557437882997
    },
    {
        "ID": "Fred McWainHillsdale",
        "name": "Fred McWain",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "More than ever before, this race felt like my mind was in complete control of my race.  It may not have been the most efficient race I have run, but I did a lot of things that you have to learn to do when racing.  I put myself in the driver seat.  I did not let any leader get out of contact of me for 3600m.  Whenever I thought I should move with someone or it got hard, my mind overturned my body to keep on the train.  Until the end, I had a mental break with 1400 to go and that is my biggest regret of the race.  It opened the door to me falling back.  I recognize it as a big pressure point, and did not properly prepare for it before the race.\nI do think I put some more tools in my toolbox of racing.",
        "positives": "(+) My mind dictated and the body raced\n(+) RACED really well for most of the race, engaged in the competition around me\n(+) Consistently Sub 16 (15:57.18)\n(-) not the mental consistency and hell-bound determination I will need for conference",
        "goal": "Goal: Win the race? NO\nGoal: momentum going into conference? Yes.",
        "turnpoint": "1400 to go:  I had a mental break and let a small gap open between me and the other 4 leaders, and it just extrapolated from there. I salvaged something with 400 to go, but I wish I was mentally consistent for the full race.",
        "attitude": "9 for 4200m, 5 for 800m",
        "effort": "8.5",
        "date": 1557437882998
    },
    {
        "ID": "Morrison IsmondGVSU AI Owens",
        "name": "Morrison Ismond",
        "meet": "GVSU AI Owens",
        "event": "1500m",
        "thoughts": "To begin, I'm happy I was able to get back out on the track and run a race to the best of my ability. With saying that, my legs were not and are not 100% ready to pick up from where I left off during spring break and it sucks. The race itself was a mental battle to get on the track and compete...I lost focus, no spring in my step, couldn't cover gaps, and my shins hurt like a mother****** respectfully. I have been excited to run the 1500 since my first one and know it's my race and I'm going to be a powerhouse runner once I get healthy/stronger mentally and physically.     ",
        "positives": "I love the 1500 and can't wait to get healthy to run another one. I was able to finish the race to say the least...Get healthy/ stronger and not be down knowing it's a process. =)",
        "goal": "My goal was to run for bodies and I wasn't able to achieve that goal to what my standards are, but I none the less competed within myself. ",
        "turnpoint": "When my shins started to hurt my mind started to wonder if I was actually ready physically to compete and it was a down hill spiral from there.   ",
        "attitude": "9",
        "effort": "10",
        "date": 1557437883011
    },
    {
        "ID": "Ryan VanAppledornGVSU Al Owens",
        "name": "Ryan VanAppledorn",
        "meet": "GVSU Al Owens",
        "event": "5000m",
        "thoughts": "I'm happy with his race. I started conservative and was picking guys off the entire race. I didn't let anyone past me and I finished hard. This was the race that I've been waiting months for. The only other races that I've run this track season have been 1500's to 2k's. It is nice to be running my event again finally. There was some back pain but it was never bad enough to hurt my race. The back pain shouldn't be a problem for Hillsdale since I don't do much running in between. Mostly cross training. My time was 17:22 which was slower than I thought I was running. The first few splits were 82's and I thought I was only getting faster but I must have slowed down at some point.",
        "positives": "I didn't get over excited and go out too quickly. I had a kick at the end though it may have been a little too much of a kick so I know I can definitely run faster at Hillsdale.",
        "goal": "I did exactly what I set out to do. I ran a positive building race without any injury getting in my way.",
        "turnpoint": "The pack that I started with slowed down a lot after a 800 so I moved past everyone and took the wind for a while but was continuously picking people off who started too fast. There was a guy who tried to take it as we went into the wind but I held him off by surging into the wind which I think broke him a little mentally.",
        "attitude": "9",
        "effort": "8",
        "date": 1557437883012
    },
    {
        "ID": "Tyler JohnsonHillsdale Gina Relays",
        "name": "Tyler Johnson",
        "meet": "Hillsdale Gina Relays",
        "event": "5000m",
        "thoughts": "I don't know why I'm not running fast right now.  I went out in a bad position and never moved forward. I haven't made a single proactive move this outdoor season and I need to make a turnaround to give our team momentum going into the post season and set us up for XC. Diemer says the best way to move forward is to win points and compete at conference, so that's what I'm going to do.",
        "positives": "(+) the race didn't take much out of me afterwards. Probably because it wasn't too fast\n\n(+) I wasn't passed in the last 2k\n\n(-) I got out bad, overcompensated, then ran outside my window",
        "goal": "No. I wanted to compete and run in the 14:20s or at least the 14:30s.  I ran 15:06, my slowest Hillsdale time ever. My team deserves better, so I will give them all I have at conference.  And it WILL be more than this week.",
        "turnpoint": "Turning point was around 2k I think. The group with Jamo went.  I didn't",
        "attitude": "8 before the race, 5 during",
        "effort": "5",
        "date": 1557437883012
    },
    {
        "ID": "Jon EllisHillsdale",
        "name": "Jon Ellis",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "I’m just frustrated. This race felt like Nationals all over again. 500m in I got clipped when the guy in front of me cut me off and the heel of my shoe came off. I ran another 200m, but was just going backwards so I decided to stop and put it back on. I probably lost 6 or 7 seconds on the field. I tried to gradually make it up and I was super engaged the whole time, but the gap just kept getting bigger. With like 5 laps to go, Diemer just told me to stop straining, which was disappointing because now I didn’t even give it everything I had, but makes sense.",
        "positives": "Positives - stayed engaged even when the gap was there. Did my best to help my teammates\n\nThings to work on - Not really sure what to do better. I really feel like I did what I could with the circumstances. It just sucks",
        "goal": "No. The goal was realistic because it was just to compete as best as I could. I couldn’t do that because the opportunity was taken from me. Not really sure what I could have done to achieve my goal.",
        "turnpoint": "500 - shoe came off, tried to run through it\n750 - put shoe back on, tried to stay engaged and bridge the gap.\n2800 - caught Justin, tried to pull him\n3200 - Diemer told us to stop straining",
        "attitude": "8",
        "effort": "5 because Diemer told be to stop straining",
        "date": 1557437883013
    },
    {
        "ID": "Addison SmithHillsdale",
        "name": "Addison Smith",
        "meet": "Hillsdale",
        "event": "Steeple",
        "thoughts": "Got out so I had space to hurdle. Found myself in first. Didn’t feel out of my depth, but then it felt like the field was on a moving sidewalk and I was running the same pace. I tried to hold on and engage the best I could. Ran out of my window and gotta learn how to pace it better with what my body has.",
        "positives": "I got out like I wanted to, too much i guess\n\nI have 35 more competetive hurdles under my belt\n\nLet loose a little more in the last 600. It hurt and it wasnt going so well, but I have to respond more than I did. I just can’t be satisfied with having nothing. It fucking sucks. Less thinking and more grit and guns blazing in the last bit.",
        "goal": "Yes I got out well\nYes I focused on hurdling aggressively\nYes I protected my space\n\nNo I didn’t finish top ten",
        "turnpoint": "Every time a new dude passed me, I should’ve made a bigger deal in latching on, esp. mid way but I achnedged it and tried to hang on, and fight but dang it.",
        "attitude": "9",
        "effort": "9",
        "date": 1557437883014
    },
    {
        "ID": "Noah CummisfordHillsdale",
        "name": "Noah Cummisford",
        "meet": "Hillsdale 2019",
        "event": "5000m",
        "thoughts": "I ran pretty well. Not perfect, but really good.",
        "positives": "Positives: I stuck on the train well. I finished very well and passed a bunch of people. I need to work on a better mentality in races of believing I can do it.",
        "goal": "I set out to PR, and I did that by 12 seconds.",
        "turnpoint": "At around 3k I felt a gap forming between me and the pack in front of me, so I decided to not let the gap get any bigger.",
        "attitude": "9",
        "effort": "9",
        "date": 1557592941975
    },
    {
        "ID": "William TerpstraHillsdale",
        "name": "William Terpstra",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "I think that I gave it all that I had, but my time wasn't the result I was looking for.",
        "positives": "+ I gave it my best shot\n+ I stayed engaged mentally\n\n- I didn't achieve my time goal\n- My last mile had some really bad splits (definitely the portion of my 5k I need to fix)\n",
        "goal": "My season goal was sub 16:00 5k for the season. My closest was 16:18 at Rhodes, probably my best race of the season. I am confident I will meet this goal come next track season.",
        "turnpoint": "I went out with the main pack. They sped up and I couldn't hold on for too long. The turning point was me not sticking.",
        "attitude": "9",
        "effort": "9",
        "date": 1557437883015
    },
    {
        "ID": "Ryan VreekeHillsdale",
        "name": "Ryan Vreeke",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "It was a solid race where I was ready mentally and worked hard throughout the race.",
        "positives": "Two positives were sticking to a good pace for the first 3k and then holding on to the pace as best as I could. Second positive was working with Noah during the race. Something I could work on is not getting cut off and being able to pass by someone quickly. That will help me to not waste energy by being slowed down. (Also could have a stronger kick).",
        "goal": "I set out to run a race where I gave all that I had and I did so I achieved my goal.",
        "turnpoint": "Turning points were at the 3k where the race gets tough and you need to hold to the pace. I held on well and bit my best to keep moving up in the race.",
        "attitude": "10",
        "effort": "9",
        "date": 1557437883015
    },
    {
        "ID": "Jon EllisConference",
        "name": "Jon Ellis",
        "meet": "Conference",
        "event": "10000m",
        "thoughts": "Such a fun race. It was a really weird experience having everyone in the race paying attention to every move I made, but I think my execution was near perfect. ",
        "positives": "+ getting the job done by winning the race\n+ being smart with my tactics\n- commanding space. I have a lot of trouble when I have someone on my outside",
        "goal": "Yes. I set out to win and put the rest of the boys in the best position to finish well. I think 1-2-6-8 speaks for itself.",
        "turnpoint": "~4k - the race was super slow and bunches up so I took it for a couple laps to string it out, which worked, and then went right back in the pack\n~6.5k - Jack Beakas and the other Trine guys made their move. Jamo and I stuck with it while Micah and Jack hung back to pick up the pieces\n8.1k - Jamo and I made our winning move and broke Beakas and Phillips",
        "attitude": "9",
        "effort": "7",
        "date": 1557794273337
    },
    {
        "ID": "Jacob PettingaConfrence",
        "name": "Jacob Pettinga",
        "meet": "Confrence",
        "event": "Steeple",
        "thoughts": "Thought it was OK",
        "positives": "My water barriers suck ass.\n\n I had fun and just raced. I scored points. I did my job.",
        "goal": "No I wanted to finish higher and break 10:00. It is possible.",
        "turnpoint": "There was this guy I was running with and he was hurting pretty bad so I used him till he fell off then tried to keep a steady pace and try to finish without getting hurt.",
        "attitude": "10",
        "effort": "7",
        "date": 1557794273339
    },
    {
        "ID": "Micah MeindertsmaMIAA Meet",
        "name": "Micah Meindertsma",
        "meet": "MIAA Meet",
        "event": "10000m",
        "thoughts": "The race went exactly to plan. We went into this 10000m knowing that we needed to score as many points as possible and we did. there isn't much else to say. ",
        "positives": "Two positives from this race are the strategy, we had a race plan and we followed it and the focus I had to reel Miller in. I still need work on the focus in the middle of the race and I want to get myself to a point where I can cover big moves like the one made by Bekas.  ",
        "goal": "Yes ",
        "turnpoint": "The biggest turning point in the race was the big move by Bekas after 5k. I responded by laying off of the initial move and slowly working my way up the field, picking off the casualties as I went. ",
        "attitude": "10",
        "effort": "9",
        "date": 1557794273336
    },
    {
        "ID": "Charles KornoeljeMIAA Conference 2019",
        "name": "Charles Kornoelje",
        "meet": "MIAA Conference 2019",
        "event": "1500m",
        "thoughts": "Very happy to be running. Frustrated that I got injured and did not run fast; I want to be running faster to help out the team because they deserve it. I ran the absolute best I could that race, I just felt out of shape and tired and my right leg/knee hurt.",
        "positives": "I stayed in the race and kicked down to guys. Mentally this was a good race.\n\nIt was my slowest race of the year.",
        "goal": "No, I wanted to stay with the top group. Thankful to be racing tho.",
        "turnpoint": "I fell from the pack at 700m in and my mentality was poor. I tried to catch up but everything was sore and tried.",
        "attitude": "9",
        "effort": "9",
        "date": 1557794273337
    },
    {
        "name": "Jacob ",
        "meet": "Island",
        "event": "1500m",
        "thoughts": "Twas OK. I should have won. If I don't break my foot I win. If I don't hit lactic so hard I win. I guess if I was just better I win.",
        "positives": "I have balls. I measured it the best I could while trying to win. I just need to be better.",
        "goal": "Kind of. Yes.",
        "attitude": "10",
        "effort": "10",
        "ID": "Jacob Island",
        "date": 1557437882978
    },
    {
        "name": "Addison ",
        "meet": "Island Meet",
        "event": "Steeple",
        "thoughts": "I'm real happy with my execution over the hurdles. There's plenty of work to be done, but I'm not scared of those things anymore. First steeple ever where I feel like I can get over all of them without a fear causing me to stutter and get closer than I should. I'm figuring out the hurdles. And them and the water barriers will get way beet as the season progresses. The legs aren't used to the race yet, but I fought. There were plenty of negative thoughts that tried to creep in, especially as the legs started to drag and Leb got farther away, but I just kept grinding. Kept taking the pain and moving forward. I'm ready to hurt, ready to grind and I'm so excited for the rest of season.",
        "positives": "Positive 1: My hurdles got better as it went. Positive 2: I made a definitive move to get around Ty when he was slowing. Work on 1: I was hurting and slowing in the final few laps. I could've pushed out the pain and hurt a little more to rally for a better finish.",
        "goal": "No I wanted to break 9:30. It seemed realistic. I gave a really solid attitude and effort. The legs weren't there, and they will be in the future. Still went out to get the most out of myself.",
        "attitude": "9",
        "effort": "9",
        "ID": "Addison Island Meet",
        "date": 1557437883016
    },
    {
        "name": "Jason",
        "meet": "Rhodes Invite",
        "event": "10000m",
        "thoughts": "It went pretty well. I was really inefficient with my start. I just didn't get out of trouble quickly enough and ended up having to close a decent gap to run with Jack. Looking back I should have just sat back and worked with Addy. On the other hand, I was on the pack really well with 7 laps to go. That Hope kid was really annoying and kept cutting into my efficiency by cutting in front of and then slowing down and speeding up and making me run in lane 2. I really need to figure out how to avoid losing efficiency to idiots like him. This",
        "positives": "Solid PR by like 40 seconds. Ran on the train for a long time. Lost focus at the wrong time and fell back a few meters when Noah made a move, and couldn't close it quickly enough. I need to be more willing to make the hard move to stay with. I know it will be better than falling back every time, I just need to override my feelings in-race",
        "goal": "Yes, ran a solid race with a good PR\nNo, I didn't negative split and I think I'm better than this.",
        "attitude": "9",
        "effort": "10",
        "ID": "JasonRhodes Invite",
        "date": 1557437883017
    },
    {
        "name": "Jamison Koeman",
        "meet": "Rhodes",
        "event": "5000m",
        "thoughts": "Went well! Went into it feeling a lot less nervous than most races, chilled through most of it behind Jon, and then followed Jon to kick as hard as I could.",
        "positives": "+ got an 8 second pr and feeling like I have more in the tank\n+ was patient, almost too patient\n\n- should’ve kicked from maybe 100 meters earlier in order to try to win it. Jon and I let that guy get away from us",
        "goal": "Yes. My main goal was to go sub 14:50.",
        "attitude": "9",
        "effort": "9",
        "ID": "Jamison KoemanRhodes",
        "date": 1557437883017
    },
    {
        "name": "Jon",
        "meet": "Rhodes Invitational",
        "event": "5000m",
        "thoughts": "This race was definitely a good step for the start of the season. I competed well and ran close to my PR, but still made quite a few mistakes.",
        "positives": "I did really well getting in a rhythm, hanging in when it got tough, and finishing hard, but I needed to get off the line better and have more confidence to go when I needed too",
        "goal": "I set out to win and I came just short of that, but it was a good stepping stone to start the season",
        "attitude": "8",
        "effort": "9",
        "ID": "JonRhodes Invitational",
        "date": 1557437883018
    },
    {
        "name": "Jacob Pettinga",
        "meet": "Rhodes",
        "event": "5000m",
        "thoughts": "It was just bad. I did not react to anything when it started going bad. It felt fast from the beginning and I should have just went straight to the back like I was planning on doing and her did work but I decided to just keep building negatives instead of building which is the only race I'm good at. ",
        "positives": "I ran close to my PR... and I guess I was able to run..",
        "goal": "No. Yes.",
        "attitude": "1",
        "effort": "1",
        "ID": "Jacob PettingaRhodes",
        "date": 1557437883019
    },
    {
        "name": "Charlie Kornoelje",
        "meet": "Rhodes",
        "event": "10000m",
        "thoughts": "Race went well. Went out with Addy and the pack of me, Mory, Fred. Hurt a lot with 3 laps to go.",
        "positives": "Stuck with the pack and grinded through the second half of the race. Negative split 16:43, 16:23.\n\nI couldn't stick with Addison and fell back. I know that I can stick better and can be a better runner.",
        "goal": "Yes, I wanted to negative split and run under 33:30. Next is to break 33:00",
        "attitude": "10",
        "effort": "10",
        "ID": "Charlie KornoeljeRhodes",
        "date": 1557437883019
    },
    {
        "name": "Fred",
        "meet": "The Island Meet",
        "event": "1500m",
        "thoughts": "Decent race, I think I ran it decently well, maybe didn't put myself out there as much as I could have, and didn't hunt the people in front of me.",
        "positives": "I raced the people around me and engaged in the competition\nI closed the race, I had a kick.\nI need to smell the people in front of me, not be afraid to take risks.",
        "goal": "Yes.  I put in a decent 1500 and not think about the 800 after, I was engaged in the moment.",
        "attitude": "7",
        "effort": "7",
        "ID": "FredThe Island Meet",
        "date": 1557437883019
    },
    {
        "name": "Jack Randall",
        "meet": "Calvin Hope \"Friendly\" 2019",
        "event": "3000m",
        "thoughts": "Felt flatter than a Mississippi mudpie. Definitely have some spring break gunk still in my legs.",
        "positives": "+ Did not let anyone from Hope beat me\n+ Was able to stay smooth and have a strong finish\n- Lost contact with my teammates too early and did not support Chris enough when he went past me.",
        "goal": "Yes, I did beat everyone from Hope which was my primary goal, however; it is hard to look back on a race where you didn't feel good and be happy about it.",
        "attitude": "6",
        "effort": "7",
        "ID": "Jack RandallCalvin Hope \"Friendly\" 2019",
        "date": 1557437883020
    },
    {
        "name": "Charlie Kornoelje",
        "meet": "Island Meet",
        "event": "5000m",
        "thoughts": "This race was mentally hard. Ran with Jack but we were all pretty tired so I took it with 7 to go. The lab counter got off and for some reason that really confused me. ",
        "positives": "Still gave a good effort and didn't use tiredness as an excuse. \nI finished the race and didn't give up even though I wanted to.\n\nOne bad thing is that I should have won the race but I didn't go with Jack and the other dude. I really wanted to but I could't find the gears.",
        "goal": "No, I wanted to braeak 16 or win and I coudln't do that.",
        "attitude": "8",
        "effort": "9",
        "ID": "Charlie KornoeljeIsland Meet",
        "date": 1557437883020
    },
    {
        "name": "Charlie Kornoelje",
        "meet": "Calvin Hope Friendly",
        "event": "1500m",
        "thoughts": "Glad to PR. Knew I could have run a lot faster.",
        "positives": "Stuck with Caleb and Jason for two laps. \nWent with Noah when he passed me.\n\nI didn't cover a gap that formed between Caleb-Jason and myself on lap 3 when I could have.",
        "goal": "No, I wanted to stick with the top group because I knew that I can.",
        "attitude": "8",
        "effort": "9",
        "ID": "Charlie KornoeljeCalvin Hope Friendly",
        "date": 1557437883021
    },
    {
        "name": "Addison",
        "meet": "Hope Dual (2K)",
        "event": "3000m",
        "thoughts": "I'm glad I stuck it out and throw my hat in the ring. It hurt a lot and its not fun to run slow, but given the circumstances I can be happy with my attitude and effort.",
        "positives": "Positive 1: I didn't come into the race with any excuses.\n\nPositive 2: I paced my energy out pretty well. \n\n\nSomething to work on: \n\n-Making a greater effort to fight a little harder to stick on early. I could've carried momentum from being on the group a little farther.",
        "goal": "Yes, I wanted to get out there and fight in a faster race.\n\nNo, I wanted to stick on Jamo, Ty, and Jon. It wasn't happening today with the energy I had.",
        "attitude": "9",
        "effort": "9",
        "ID": "AddisonHope Dual (2K)",
        "date": 1557437883021
    },
    {
        "name": "Jon",
        "meet": "Hope Dual 2k",
        "event": "1500m",
        "thoughts": "Went well as a whole. It was nice to come away with the win. We could have worked a little harder in the middle laps though and I could have orchestrated that if I had more confidence to push when I’m leading.",
        "positives": "Positives: Won the race and wound up the last lap well, and led the whole thing which I haven’t done much successfully\nThings to work on: Leading and pushing the lead confidently",
        "goal": "Yes. I wanted to win and I did. I just wish I had pushed the middle harder to work a little more.",
        "attitude": "8",
        "effort": "7",
        "ID": "JonHope Dual 2k",
        "date": 1557437883021
    },
    {
        "name": "Fred McWain",
        "meet": "Calvin Dursts Hope Duel(Dual?) meet",
        "event": "3000m",
        "thoughts": "it was good, not great, but good.  It was nothing special but I recognized where my body could handle and I worked from there to build positives. Not bad for a scrub.",
        "positives": "+beat all hope chumps (not hard when they run stupid races)\n+built positives throughout the race\n+stayed engaged and made race moves happen\n-didn't have the kick I wish I did, I lost the fight because I didn't think I was better than the people in front of me, which is a stupid reason.",
        "goal": "Goals: \nsub 9:20? Yes, 919.27\nbuild confidence? Yes, confident for next week's 5k\nBeat all Hope? Heck yeah.",
        "attitude": "8",
        "effort": "6",
        "ID": "Fred McWainCalvin Dursts Hope Duel(Dual?) meet",
        "date": 1557437883022
    },
    {
        "name": "William Terpstra",
        "meet": "Hope/Calvin Dual",
        "event": "1500m",
        "thoughts": "The 1500 went well overall I would say. I am still a little confused how to pace myself and race it. I ran 4:22, which isn't amazing, but it's somewhere to work from. I also ran a 4 x 400 and split a 58.3 I believe. That was fun and something I have never done before...",
        "positives": "(+) A good race to stay in a competitive mindset\n\n(+) ran 1st ever competitive 400m\n\n(+) Family somehow made it to the meet at the last minute\n\n(-) Keep learning how to pace for a 1500m\n",
        "goal": "I set out to compete. I gave the race what I had that day, but I wish my time was under 4:20. That'll be my goal from here.",
        "attitude": "9",
        "effort": "8",
        "ID": "William TerpstraHope/Calvin Dual",
        "date": 1557437883023
    },
    {
        "name": "Tyler Johnson",
        "meet": "Hope Dual 2019",
        "event": "2000m",
        "thoughts": "I wish I had more energy to put into this race or that I had wanted to.  From the gun I wasn't inclined to lead, and the Hope guys running a workout and screwing around didn't help the atmosphere.  Ran 67 68 69 69 63 to get 2nd to Jon's school-record setting performance.",
        "positives": "(+) --> We finished hard with a 63 and then all (except Addison, who wimped out) came back and hit a good 4x4 split.\n\n(+) --> I felt like I could have done another 2k at the exact same pace after that one; granted it would have been a lot harder, but the race just felt kinda slow.\n\n(-) --> I didn't run like I was passionate about running yesterday, and it showed.  I need to show the confidence that I felt going into the indoor postseason.",
        "goal": "I don't know what my goal was for this race, which is really a problem.  My goal was probably to win, but I didn't feel as strongly about it as I should have, which is why I lost.",
        "attitude": "4",
        "effort": "4",
        "ID": "Tyler JohnsonHope Dual 2019",
        "date": 1557437883023
    },
    {
        "ID": "JasonHope Duel",
        "name": "Jason",
        "meet": "Hope Duel Meet",
        "event": "1500m",
        "thoughts": "This was one of my best races. I know there were some important faults, but it was a really solid stepping stone after being so badly sick last week. I was preparing myself to be ready to go with guys like Hoffman and Murphy, but then I got the line and there was just some rando guy that I never saw the entire race. Got out aggressively to get right in behind Caleb and Noah. When Noah slipped back a bit on the 3rd curve, I filled the gap and kept pushing on Caleb. Then I started to feel really good with 700m to go, so I tried to go around Caleb, but he responded before I could really do anything, then I had to chase him down again and never caught back up. I definitely had a chance to make another hard move with 500m to go because Caleb slowed down a bit, but I wasn't confident enough to take that because I was worried about finishing. Noah caught me with 100m to go, and couldn't really respond, then Charlie came with 50m to go, and I dug really hard for that final gear and was able to nick him at the line for 3rd.",
        "positives": "Positive 1: I prepared very well mentally and was ready to go out hard, so I was ready to just move onto Caleb's shoulder when the opportunity arose.\n\nPositive 2: Had a lot more confidence this race. I think I'm beginning to understand that I am in shape and I just need that mental edge like a had for the first 1200m and the last 50m.\n\nMy main regret is not trusting myself with 500m to go and blast a hard move to get back on Caleb's shoulder. I was really only like 20m back, just out of contact.",
        "goal": "My goal was to compete like I haven't in many of my other races. I definitely did that by going with Caleb when he broke away and gunning for it with 700m to go when I could smell the barn and not backing off just because Caleb is faster than me. I think that will be important in later meets.\n",
        "attitude": "8",
        "effort": "9",
        "date": 1557437883024
    },
    {
        "name": "Jamison Koeman",
        "meet": "Hope Dual",
        "event": "2000m",
        "thoughts": "Race was weird. Just felt like a workout because it was just Ty, Jon, Addi and I up front.",
        "positives": "+ I felt good and kicked probably harder than I have ever kicked.\n\n- Terrible tactics on my part. I should've taken the race with 400 to go but instead got clogged at 200 and had to maneuver around Ty when we were in full sprint.",
        "goal": "I wanted to win the race and I did not achieve that.",
        "attitude": "6",
        "effort": "7",
        "ID": "Jamison KoemanHope Dual",
        "date": 1557437883025
    },
    {
        "name": "Jacob",
        "meet": "Hope Calvin \"friendly\"",
        "event": "3000m",
        "thoughts": "It was hard for me to feel like this race was important and I did bad because of it because when it started to get hard there was no reason to push. ",
        "positives": "There really are no positives.\n\nWork on not being a pansy.",
        "goal": "No. Yes.",
        "attitude": "5",
        "effort": "5",
        "ID": "JacobHope Calvin \"friendly\"",
        "date": 1557437882978
    },
    {
        "name": "Caleb Ferguson",
        "meet": "Calvin Hope Dual",
        "event": "1500m",
        "thoughts": "This one wasn't too much of a race overall for me. I had felt not great and tired going into it and I knew competition was not going to be there so there wasn't a ton of hype going into it but I did what I needed to do which was run a building race and win.",
        "positives": "+I won\n+I responded when Jason came up on my shoulder.\n-I didn't think about how I could help my teammates in this race as much as I should've.",
        "goal": "Yes, I was going to win and run a building race and I did that.",
        "attitude": "5",
        "effort": "3",
        "ID": "Caleb FergusonCalvin Hope Dual",
        "date": 1557437883025
    },
    {
        "name": "Caleb Ferguson",
        "meet": "Island Meet",
        "event": "Steeple",
        "thoughts": "It was more of a grind than I was expecting. I didn't have as good of focus on my overall goal as I wish I would've liked in the middle, but focusing on time also never works for me. So, not sure overall what I should've done differently, but I was 1k away from doing very very well.",
        "positives": "+Best I have ever been at this point.\n+Hurdling was overall very solid.\n-Didn't do what I wanted to.",
        "goal": "No, but in retrospect it was going to be exceptionally difficult to accomplish what I originally said that I wanted to do in this race.",
        "attitude": "8",
        "effort": "8",
        "ID": "Caleb FergusonIsland Meet",
        "date": 1557437883026
    },
    {
        "name": "Caleb Ferguson",
        "meet": "Rhoades",
        "event": "5000m",
        "thoughts": "This race was extremely unexpected. I thought I was going to be very tired, because I had been for a little while now, but I got in the race and had a lot more energy than I expected. I ran a PR which is always a positive, but I think I left a lot out there because I didn't have the confidence to go with Jamo and Jon.",
        "positives": "+PR and I clearly am in a much better place than indoor.\n+Followed up the positive performances set before me.\n-Didn't stick on the pack when I needed to in the middle and just go for it.",
        "goal": "I am not sure what I wanted out of this overall, I guess just a good start and I definitely got that. I now know I have a lot more in the tank than I thought so that is good looking forward. I also stayed engaged the whole time even when I was in no man's land.",
        "attitude": "7",
        "effort": "7",
        "ID": "Caleb FergusonRhoades",
        "date": 1557437883026
    },
    {
        "ID": "Noah CummisfordHope Calvin Friendly",
        "name": "Noah Cummisford",
        "meet": "Hope Calvin Friendly 2019",
        "event": "1500m",
        "thoughts": "I felt kinda sick, and my legs were really tired. I did not do a great job of staying engaged in the race.",
        "positives": "+ Good finish\n+ Beat everyone from Hope\n- I need to do bettef with focus in races\n",
        "goal": "I set out to try and win, but I didn’t beacuse of a variety of factors. I will try to recover as best I can for next week.",
        "attitude": "5",
        "effort": "6",
        "date": 1557592941972
    },
    {
        "name": "Ryan Vreeke",
        "meet": "Calvin Hope Duel",
        "event": "3000m",
        "thoughts": "My teammates and I made due with the competition and had our minds focused on running competitively.",
        "positives": "I ran a good strategic race.\nI took the lead to work on and help the pace of the race.\nI need to work on finishing stronger.",
        "goal": "I achieved what I set out to do. I wanted to not be complacent during the race and I made good decisions when they arose and it was a solid effort as well.",
        "attitude": "9",
        "effort": "8",
        "ID": "Ryan VreekeCalvin Hope Duel",
        "date": 1557437883027
    },
    {
        "name": "Justin Varineau",
        "meet": "Island Meet",
        "event": "1500m",
        "thoughts": "Not too happy with this one. I was gassed, and I didn't run it smart, so those two made for a sub-par race.\n\nI wasn't as confident before the race as I should've been either. Confidence can go a long ways, so I need to make sure my mindset is in the right place going in.",
        "positives": "+: I attacked the first lap. In hindsight, I attacked it a little too much, but I'm happy that I went for it.\n\n+: Not getting down on myself after the race finished.\n\n-: Staying mentally in it when things start going downhill. With 800 to go, I wish I had tried to reengage more and finish it out strong.",
        "goal": "I did not. The goal was to win, and I was a lonnnnngggg ways from doing that. \n\nI've got my eyes set on next year's Island meet though!....actually, not really, but when it rolls around, I'll be hoping for a bit of redemption",
        "attitude": "5",
        "effort": "6",
        "ID": "Justin VarineauIsland Meet",
        "date": 1557437883028
    },
    {
        "name": "Justin Varineau",
        "meet": "Rhodes",
        "event": "10000m",
        "thoughts": "This was a super duper long race, but it was also a party. I didn't think I was gonna like the 10k this much, but I'm a big fan",
        "positives": "+: Starting off controlled and not being antsy in the first 3 miles\n\n+: Staying mentally engaged in the last mile when the Huntsville dude took the lead\n\n-: I need to run it with more confidence. Though I'm extremely happy with how the race went, in 10ks where I won't be near the front, it'll be important to trust my instincts and make moves that I need to make.",
        "goal": "Yes. I hit the paces I wanted to hit and stayed mentally engaged the whole way.",
        "attitude": "10",
        "effort": "9.5",
        "ID": "Justin VarineauRhodes",
        "date": 1557437882978
    },
    {
        "name": "Jason",
        "meet": "Michigan State",
        "event": "5000m",
        "thoughts": "I just didn't know what I was really supposed to do. My plan was to go with the group and hang on. Didn't focus on pace, but I heard the first two laps 73, perfect, then 71 okay, then I went through the mile in 4:47 apparently. So obviously that was not sustainable. Felt the lactic creep around 2k, but I was prepared to go for it. The next 3k was just a grind fest as Jack and I tried to salvage some sort of efficiency on the back half to keep it rolling, but ultimately both of us were just smoked. Last mile was just hell. Reminds me of another race I ran at Michigan State in XC.",
        "positives": "Ran within my window after blazing the first mile. Stuck to Jack even though I was dying. Progress on the skill of sticking so that's good. Lost focus in the last few laps and didn't close very hard. Wasn't very efficient in the first mile kept losing my position because I didn't fight for it quickly enough when people tried to cut in front of me. I need to learn how to be a better semi-truck.",
        "goal": "I wanted to hang in the pack as long as possible. I didn't because I bailed around 2k because everyone was just out so quick. I didn't do what I set out to do, but I fought in the ensuing grind all the way to the finish with Jack. Felt like cross country all over again.",
        "turnpoint": "Near the Mile - Decided to let the pack ahead of me go because I thought hey were out too fast.\n\n3k - Took it from Jack to help out and try to make it as efficient in the second half as possible by trading leads",
        "attitude": "7",
        "effort": "10",
        "ID": "JasonMichigan State",
        "date": 1557437883028
    },
    {
        "name": "Fred McWain",
        "meet": "MSU",
        "event": "5000m",
        "thoughts": "This was good.  I took chances, I threw my hat in the ring and positioned myself for the win.  I stayed out of trouble early, didn't actually touch the inside of lane 1 until the last lap.  I came up on the shoulder of the leader with a mile to go and used it to recollect myself from the charge that I made, but I think that also did me in a bit, becuase I had no finish to the race.  I struggled to get to the line, but that also means I put myself out there and I gave it some guts. *Update* I asked Diemer if that was a smart move to sit, he said based on how I finished it probably was the better choice, otherwise I might have not broken 16.",
        "positives": "+ I continued the immense amount of momentum that I have built this season, I came in the day with no doubt in my mind that I could get it done.\n+ I worked through the field that I was in and made smart race choices, to give myself the best chance I had \n- I didn't finish still, I think it was actually my slowest lap, but also I was pretty gassed at that point, so not too negative",
        "goal": "Goal: Sub 16. 15:53.38\n",
        "turnpoint": "1k: the field started to break up, Charlie covered a gap and I knew if I wanted to do well I had to cover it too.\n3k: I was moving towards the leaders and thought to myself \"2k isnt that far\" because thats what I told myself for the week up to the race.\nmile to go: Sat on the leaders, used it to collect myself for the last bit of the race.\n400 to go: wow I struggled to finish.",
        "attitude": "10",
        "effort": "9.7",
        "ID": "Fred McWainMSU",
        "date": 1557437883029
    },
    {
        "name": "Fred McWain",
        "meet": "The Island Meet",
        "event": "1500m",
        "thoughts": "Decent race, I think I ran it decently well, maybe didn't put myself out there as much as I could have, and didn't hunt the people in front of me.",
        "positives": "I raced the people around me and engaged in the competition\nI closed the race, I had a kick.\nI need to smell the people in front of me, not be afraid to take risks.",
        "goal": "Yes.  I put in a decent 1500 and not think about the 800 after, I was engaged in the moment.",
        "attitude": "7",
        "effort": "7",
        "ID": "Fred McWainThe Island Meet",
        "date": 1557437882978
    },
    {
        "name": "William Terpstra",
        "meet": "MSU",
        "event": "5000m",
        "thoughts": "Race went out slow first 200m, then picked up pretty quick after that. I competed, but my time just wasn't there. My body just didn't feel fast or feel like it had the spring that it needed.",
        "positives": "I still gave it my best effort despite my time maybe not reflecting that.\n\nI may have doubted myself with 3 laps to go. That's always the hardest part for me.",
        "goal": "No, I wanted to be at 16:10. So, quite a ways off. Next time.",
        "turnpoint": "I never feel like I have a definitive answer for this question. Perhaps the turning point was when the main pick split off in front of me. Obviously, I would have like to be able to stick with it, but I couldn't muster enough to be there.",
        "attitude": "7",
        "effort": "9",
        "ID": "William TerpstraMSU",
        "date": 1557437882978
    },
    {
        "name": "Ryan Van Appledorn",
        "meet": "Calvin Hope Dule",
        "event": "2000m",
        "thoughts": "This was a good race despite not having competition. I feel like I ran to the best of my ability.",
        "positives": "I kept a good pace and kicked at the end. I didn't have any back or shin pain. There was some tightness in my back in the last 600m so I still have some work to do to get myself completely healthy and ready to race the 5k and 10k.",
        "goal": "I wanted to get out hard and finish hard and I did that.",
        "turnpoint": "There was nobody around me to to push me along but when it came to the final lap 200m I kicked hard anyway.",
        "attitude": "10",
        "effort": "10",
        "ID": "Ryan Van AppledornCalvin Hope Dule",
        "date": 1557437883029
    },
    {
        "name": "Jack Randall",
        "meet": "MSU",
        "event": "5000m",
        "thoughts": "This was definitely an interesting one. I had a good feeling that the race was gonna go out hard, and it did. I did my best to hang back and take it easy while maintaining solid contact on the pack. This did mean that I was out in 4:50 which is a little quick for me right now. Most of my teammates were out much, much faster, with big Klaasen being the next guy ahead of me being out in 4:47. Eventually the pack I was with realized that this pace was just too hot for them and came back to me. I then was running with three others: the moose caboose Jason Klaasen, an Aquinas duderino, and some jamoke from SHU. I went around them and they latched onto me, which I was not really too upset about because having people chasing you is better than having nobody at all. After another lap the Aquinas duderino took it from me which initially I was pretty happy about because I thought that it meant I was going to be able to settle in on his pace. Jason moved up next to me too, which again, I was pleased with. He looked like he wanted to take it back from the Aquinas guy but I grunted or did some sort of gesture to him trying to convey that I thought it would be wisest for us to sit on this guy if he was gonna do the work. The moose understood. Shortly after coming to this understanding the Aquinas guy started to slow down. It was very perceptible to me, and I tried to convey this to Jason but to no avail. I was not trapped in the awkward spot of being between the outside trail leg of the Aquinas guy and the loping stride of the moose. After probably only 50m of contemplation, I gave the moose a gentle nudge signifying my presence and intentions. I was a little nervous about jumping out in front of Jason because he has a long stride and I did not want either of us to get tangled up (especially after witnessing the calamity of Vreeke's spill at spring break). Fortunately I was able to slip pas him and back out around the Aquinas guy to re-assume the lead of my pack. At this point there was now at least a 50m gap between myself and the next runner up, which was Jacob. He looked like was hurting, I could see it in his form. In hindsight, this was where the race decision needed to be made. I had two options in retrospect: make a hard move and remove myself from my comfort zone to try to go up to Jacob in only a lap or two, or make an easier move to try to drag Jason along with me up to Jacob over the course of a few more laps. I chose the second option, and I now wish I hadn't. What happened was this: for the remainder of the race Jason and I would trade the lead trying to slowly creep up to Jacob. Every time Jason took the lead from me I could feel the pace slow down, and I needed to take it back from him after only a lap or so. Every time I took the lead, I am sure that Jason felt like it was slowing down, so he would take it back from me. We definitely got caught in this vicious cycle of trading the lead every 300-400m. This was neither efficient nor did it help us catch up to help Jacob any faster. Now with the finish creeping up on us (1200m to go) I took the lead one final tme from Klaasen. We had not made up enough ground, and I felt like we were beginning to die basically at the same rate as Jacob. It was time to try and salvage the race. I knew that at this point the race was not going to be particularly fast, and that our in-race strategy had been pretty piss-poor, however; I was still determined to make the most of the opportunity to run fast. I remember thinking about this as I took reigns back from Klaasen. It was a substantial move, and nearly as soon as I made it I heard someone shout from the in-field \"No gaps Jason!\". I worried for a second that I had just left Jason out in the cold, but then remembered that this was a now-or-never move and knew that we both had to decide to sink or swim. After 400m of this new pace I felt the moose resume to be my caboose and I was happy that he had the guts to come with me. As I was thinking this with 800m to go the aforementioned runner form SHU went around me at a pretty good clip. I had totally forgotten that he was in the race and honestly had thought that we had dropped him a while ago. This new pace injection was pretty unwelcomed by my body, which makes sense in the last 800m of a 5k. I dug pretty deep to attach myself to this new move but was unsuccessful. I believed at that moment in the race that I didn't have the legs to go quite with it. I did not let him run completely away from me however. I did get dragged along for another lap and with about 600m to go really felt myself hit lactic pretty good. My last lap was nothing too crazy, I definitely had a little bit of a kick but I did not blow the doors off of anyone. I did close the gap on the SHU guy, but did not beat him. I finished probably 5, behind him and maybe 20m or less behind Jacob.\n\nI felt pretty shitty afterwards and I ran around 16:00 for the 5k. Exact times are unknown due to an error in the timing system. Looking back I wish that I had made better in race decisions. The first of these is that I wish I had gone out a little harder. This is definitely not a normal thing for me to write after a race but the logic behind it is this: if I had gone out a little faster I think that I could have run in the pack that Jacob was in. Even if being there doesn't stop him or I from falling back a bit, I would then be in the same situation, just 10 seconds farther up. In addition to this, I could have maybe worked with that pack better anyways, as it was bigger than the one I was in. Basically, I just believe that the opportunity cost of going out maybe 5 seconds faster in the first mile would have been better than hanging back like I chose to. I still want to chew on this one more, even though it looks like I have completely dissected it. This type of failure is making me hungry for another chance to race. Fortunately I will be getting another shot this weekend at Oakland. I cannot keep fucking up like this. I have trained way too hard over the course of five years to only run well at Hillsdale. I will be better at Oakland this weekend because my teammates need me to be, and more importantly, they deserve that I be.",
        "positives": "+Ran well with a teammate\n+Was cognizant of the race situation\n-Need to get better at closing larger gaps and deciding to do so quickly",
        "goal": "I wanted to run close to my PR and I did not do this. The race was set up well for this and I do not feel like I took full advantage of it.",
        "turnpoint": "I had two options in retrospect: make a hard move and remove myself from my comfort zone to try to go up to Jacob in only a lap or two, or make an easier move to try to drag Jason along with me up to Jacob over the course of a few more laps. I chose the second option, and I now wish I hadn't.",
        "attitude": "8",
        "effort": "7",
        "ID": "Jack RandallMSU",
        "date": 1557437883029
    },
    {
        "name": "Ryan Vreeke",
        "meet": "Michigan State",
        "event": "5000m",
        "thoughts": "It was a race that had a lot of us guys looking to do well in the field of competition.",
        "positives": "A positive was running around 9:03 for the 3k showing that after that point I just need to keep the pace going. It was also a pr which was a positive. Something to work on is my mental state when things get in the situation of needed to stick despite how much energy I have previously used. ",
        "goal": "I did achieve my goal. I ran my second 5k in a way that I know I can progress and run an even faster one in the future.",
        "turnpoint": "The turning points happened when I knew that I was going at a fast pace to begin with, but then I needed to stick to a group and keep with the pace. This was very difficult to do both mentally and physically. I gave as much as I could, but I need to do better when I am finishing my races.",
        "attitude": "9",
        "effort": "7",
        "ID": "Ryan VreekeMichigan State",
        "date": 1557437883030
    },
    {
        "name": "Addison",
        "meet": "MSU",
        "event": "Steeple",
        "thoughts": "In general I thought this Steeple was another step in the right direction. The time was not there and that's not ok, I'm not settling for running in the 9:40's, but within that race was some process pieces that I put together well. ",
        "positives": "-I did a really good job of working through the field in the middle\n\n-I hurdled quite well in the middle.\n\n\n-I did a good job of leaving my excuses aside. The body felt like it was lagging Thursday-Saturday, which is a product of the hurdles, and lifting along with the miles which I will significantly lessen to stay fresh and strong physically and mentally through the course of each week coming up.\n\n\n\nWork On:\n\n-I can't be afraid to continue to attack each hurdle as I start to get tired at the end of a steeple and I have to be increasingly cognizant what is happening in the race around me. \n\n-As my hurdling progresses they will become more habit, but at the end of the race I must not think more than keeping myself distanced from them, snappy, and upright (the technique), rather than them becoming mental barriers to get over as well as physical.\n\n-This goes for waters as well",
        "goal": "I competed well at the beginning, but that caused for inefficiency because my set-up at the beginning was a bit lacking. \n\nI could've competed better at the end, but the extra fatigue I felt when the move was made was a product of the inefficiency earlier in the race and the overkill of activity leading up to the race. \n-I need to compete to the very end to get the times I'm looking for\n\n\nMy hurdles overall were good\n\n\nBiggest positive was working through the field and hurdling relatively efficiency for how many people I worked through. (Too many people worked through as I said before.)",
        "turnpoint": "The turning point of the race was when around 1200 or a bit less to go I started to really hurt, very quickly. I fought through it as the Aquinas guy passed me again, but I should've just went with him and latched on way more intentionally. I let the pain and me managing each hurdle get in the way of me reacting to the hard move made back around me. If I latch on right away, I stay more engaged and I drop a couple more seconds. Also, at the end I should've kicked harder. I let the pain get the best of me around the final 250.",
        "attitude": "8",
        "effort": "8",
        "ID": "AddisonMSU",
        "date": 1557437883030
    },
    {
        "name": "Caleb Ferguson",
        "meet": "MSU Spartan Invite",
        "event": "1500m",
        "thoughts": "This was another solid one. I am building really good momentum early in the season which is great for me because I intend to run pretty fast next week. I felt in control basically this whole race which makes me wish I went for more on the 2nd to last lap. I wish I had more teammates in this with me because I think that makes me run better.",
        "positives": "+Not afraid to go and take the race when I felt the energy to do so.\n+Got out well and positioned myself more or less perfectly.\n-Didn't have the wheels to go later in the race, but again idk if I had control over that at all.",
        "goal": "Goal was to set myself up well for next week and to keep building positive momentum. I also wanted to PR in the event and I did all of that.",
        "turnpoint": "I felt I had 3 turning points probably. The first was when I took the lead at 800 to go. That move wasn't forced, it just flowed and I went for it when I felt the energy\nSecond would be when I felt the dudes come on my shoulder the first time and I held them off to make sure I didn't just take the lead to give it back the first time it got hard.\nThe third was when at 400 to go those dudes made a harder move to go around me. I wanted to go with but I felt like I couldn't go any faster. It was different for me, maybe if I had been more prepared mentally I could've but I'm not sure still.",
        "attitude": "9",
        "effort": "9",
        "ID": "Caleb FergusonMSU Spartan Invite",
        "date": 1557437883031
    },
    {
        "name": "Simon Detmer",
        "meet": "MSU Spartan Invite",
        "event": "800m",
        "thoughts": "I ran it well except when I ran a 40 sec 200m between 400m and 600m.",
        "positives": "I felt relaxed during the first 400m and was happy to run a 67 second first 400m.\n\nI believe that I need to work more on the 3rd quarter of the race (600m-800m).\n\n",
        "goal": "Yes, I ran my PR and broke the T37 U20 800m national record. I did not run sub 2:20, but I am still very satisfied with my race. I believe that with a little more training, I can run sub 2:18 and maybe break the all time national record (2:16.93) before the end of the year.",
        "turnpoint": "When I ran my first 200m in 32 seconds and was not tired, I became confident that I could run a fast 800m. I was also reassured at the 400m mark when I ran a 67 sec. split and was motivated at the 600m mark when I heard that I ran a 117 sec. 600m, which is 3 sec. slower than my 600m PR.",
        "attitude": "10",
        "effort": "10",
        "ID": "Simon DetmerMSU Spartan Invite",
        "date": 1557437883031
    },
    {
        "name": "Nathan Klaassen",
        "meet": "Michigan State",
        "event": "5000m",
        "thoughts": "Got put into heat 2 of unseeded 5k and was the no. 1 seed. I decided that I would have to be aggressive and set the pace so that I could get into a good rhythm at my own pace. First k was a little bit slower than I wanted it to be and picked it up slightly and thinned out the front pack out a little bit. Race basically started with 7 laps to go when it became a race between me and a guy from Michigan Tech. Felt really good at this point and started throwing in some surges to form a gap. With 4.5 laps to go the guy from tech started to get onto my shoulder and was looking to pass me. Kept him on the outside in lane 2 and kept beating him to the corner every 200 meters. Had to beat there 4-5 times in the last few laps until the bell lap. Once I got to the bell lap I knew that I had the race won as long as I kicked before him since I had the positioning on the inside while he was on the outside. Had a good kick at the end with a final lap of 71 and won by 6 seconds.",
        "positives": "great positioning throughout race\ngood kick on final lap\n\nCould work on pacing a little bit better since first few laps were slower than I wanted them to be.\n\n\n",
        "goal": "Win the race and pr. Didn't pr since it was hard for me to push the pace from the front but made smart moves throughout the race and won the race.",
        "turnpoint": "600-1000 meters was the hardest part of the race as it got harder and harder to be the first to the corner. Just kept thinking to get to the bell lap first since once I got to 400 meters to go I knew I could out-kick the tech guy if I had a good position in the last lap.",
        "attitude": "10",
        "effort": "9",
        "ID": "Nathan KlaassenMichigan State",
        "date": 1557437883031
    },
    {
        "name": "Charlie Kornoelje",
        "meet": "MSU Invite",
        "event": "5000m",
        "thoughts": "Very pleased to have broken 16 with a 15:58.94. I don't think I would have broken 16 if the team wasn't there cheering me on; I'll have to work on the intrinsic motivation. \nMy right calf has been hurting and halfway through the race it was pretty painful and hurting my form. I know I can run a lot faster once I get totally healthy.",
        "positives": "I stuck on and didn't fall back as hard as I have in other races. Went out in a 5:05 ish. \nReally dug deep the last 400, I knew it was going to be close, didn't think it was going to be this close tho.\n\nFell back from Fred's pack when I needed to cover it and not struggle later in the race.",
        "goal": "Yes, I broke 16",
        "turnpoint": "Stuck with the top group when the race started to spread out around the 1 mile. \nAround the 2 mile, Fred passed me and slowly pulled away. \nAddison told me to sit on the guys and kick them down rather than try to catch Fred, and at that point in the race, that is what I needed to do.",
        "attitude": "7",
        "effort": "8",
        "ID": "Charlie KornoeljeMSU Invite",
        "date": 1557437883032
    },
    {
        "name": "Micah Meindertsma",
        "meet": "MSU",
        "event": "5000m",
        "thoughts": "The 5k went out really fast, ~14:20 made. I freaked out over how fast is was and lost focus in the middle. However I was able to reengage in the second half and end up running a good race. ",
        "positives": "I held myself together at that fast pace and did not blow up. I was able to reengage even after a shaky start. I need to maintain focus even when the unexpected happens. ",
        "goal": "I did. I was able to focus in the second half and be tough after I reengaged. ",
        "turnpoint": "The two turning points where when I went out way too fast for the mile and fell off. the second was when I got caught by a pack and engaged with them to pull me back  up",
        "attitude": "10",
        "effort": "7",
        "ID": "Micah MeindertsmaMSU",
        "date": 1557437883032
    },
    {
        "name": "Ryan Van Appledorn",
        "meet": "Michigan State Invitational",
        "event": "1500m",
        "thoughts": "I did not race smart and paid for it.",
        "positives": "I had no back pain. I had a good attitude going into it but I did not use my brain when it was time to race. I need to tone down the excitement of getting to race finally after months of injury and focus more on being smart figuring out my pace.",
        "goal": "No. I achieved nothing in this race.",
        "turnpoint": "The race went out at what I thought was slow and I stayed in second thinking that I was okay there. After the first 700m I was struggling to hang on. I realized I went out to fast and went out the back. At the end I had no kick to bring it back.",
        "attitude": "9",
        "effort": "4",
        "ID": "Ryan Van AppledornMichigan State Invitational",
        "date": 1557437883033
    },
    {
        "name": "Jon Ellis",
        "meet": "Hope Dual 2k",
        "event": "1500m",
        "thoughts": "Went well as a whole. It was nice to come away with the win. We could have worked a little harder in the middle laps though and I could have orchestrated that if I had more confidence to push when I’m leading.",
        "positives": "Positives: Won the race and wound up the last lap well, and led the whole thing which I haven’t done much successfully\nThings to work on: Leading and pushing the lead confidently",
        "goal": "Yes. I wanted to win and I did. I just wish I had pushed the middle harder to work a little more.",
        "attitude": "8",
        "effort": "7",
        "ID": "Jon EllisHope Dual 2k",
        "date": 1557437883033
    },
    {
        "name": "Jon Ellis",
        "meet": "Hope Dual",
        "event": "2000m",
        "thoughts": "Went well as a whole. It was nice to come away with the win. We could have worked a little harder in the middle laps though and I could have orchestrated that if I had more confidence to push when I’m leading.",
        "positives": "Positives: Won the race and wound up the last lap well, and led the whole thing which I haven’t done much successfully\nThings to work on: Leading and pushing the lead confidently",
        "goal": "Yes. I wanted to win and I did. I just wish I had pushed the middle harder to work a little more.",
        "attitude": "8",
        "effort": "7",
        "ID": "Jon EllisHope Dual",
        "date": 1557437883033
    },
    {
        "name": "Jon Ellis",
        "meet": "Bucknell",
        "event": "10000m",
        "thoughts": "Definitely the most painful race of my life. I pushed myself to the absolute limit to the point that I couldn't stand after the race because I was almost passing out. I just got off the line hard to make sure I didn't get caught in a scuffle and found myself running 29:45 pace for the first half of the race. I felt so good that I thought I may be able to sustain the pace throughout, but when I hit the wall, I hit the wall HARD and there were still 8 laps left. I hung on as best I could, but I was just dying. Overall, I'm really happy with the effort because I tested myself against the best of them and was still able to gut it out when I was hurting.",
        "positives": "Positives: Testing myself against a really good field, being efficient even at a really fast pace, and pushing through when it hurt\n\nThings to work on: Going out at a more reasonable pace",
        "goal": "Yes. I told myself before the race that I was only going to be happy with the race if I ran faster than 30:25 and booked a guaranteed ticket to Nationals. I came up just short of that. However, I gave it everything I had with what God gave me on the day, and I think I inspired my teammates in the process. I couldn't call that anything but success.",
        "turnpoint": "2k - I realized how fast we were going and debated dropping back, but everyone was telling me to just relax and be smooth and I didn't want to find myself in no man's land so I just stuck\n7k - I finally started dying. I went from running 72 to 78. I did my absolute best to reengage and push through, especially when I got passed.",
        "attitude": "10",
        "effort": "10",
        "ID": "Jon EllisBucknell",
        "date": 1557437883034
    },
    {
        "ID": "Jacob PettingaAl owens",
        "name": "Jacob Pettinga",
        "meet": "Al owens",
        "event": "1500m",
        "thoughts": "It was positive",
        "positives": "It was positive. I followed out a my race plan. \n\nI got boxed in 3 times.",
        "goal": "Yes. Yes ",
        "turnpoint": "I started out in lastish. Jamo pulled me through towards the front.",
        "attitude": "7",
        "effort": "7",
        "date": 1557437882983
    },
    {
        "ID": "Noah CummisfordMIAA Outdoor Conference 2019",
        "name": "Noah Cummisford",
        "meet": "MIAA Outdoor Conference 2019",
        "event": "5000m",
        "thoughts": "I got 5th, which is awesome! I feel like I could have ran faster if I believed in myself more, but at least I beat everyone I was supposed to beat. I need to stick more in the middle of races.",
        "positives": "Positive: I scored points for the team and had a massive kick at the end. I NEED to just stop thinking about anything except sticking in the middle of races.",
        "goal": "I set out to score for the boys, and I did.",
        "turnpoint": "Near the middle I fell off the front pack and I should have re-engaged, but I did not fully do that. At the end I was not sure if I could catch the guys in front of me because they pulled away earlier, but I kicked really hard to pass them.",
        "attitude": "9",
        "effort": "7",
        "date": 1557794273334
    },
    {
        "ID": "Jamison KoemanMIAA Championships",
        "name": "Jamison Koeman",
        "meet": "MIAA Championships",
        "event": "10000m",
        "thoughts": "Went really well. We did what we wanted to do in that race. Jon and I were able to leave the Trine guys in the dust with 2k to go.",
        "positives": "+ stayed mentally focused through a boring first 5k\n+ powerful move with Jon. It really makes a difference when teammates can move together\n\n- I don’t really have any negatives other than losing to Jon. I thought that race was executed nearly perfectly from Jon and I",
        "goal": "I set out to finish top 2 and I achieved that goal",
        "turnpoint": "5k - Beakas took it, not a hard move to cover\n8k - Jon and I went to win it and we dropped everyone pretty easily",
        "attitude": "9",
        "effort": "7 - not a particularly hard race but the effor was where it needed to be on that day",
        "date": 1557794273337
    },
    {
        "ID": "Tyler JohnsonMIAA Championships at Hope",
        "name": "Tyler Johnson",
        "meet": "MIAA Championships at Hope",
        "event": "5000m",
        "thoughts": "This was MUCH better and smoother than my 5k.  I felt in control the whole race and the team had a much better finish.",
        "positives": "(+) I doubled back much better than I expected after the 1500\n\n(+) By being up in near the lead, I hope that I was an encouragement to those running behind me, for my 5k teammates finished much better than in the 15.",
        "goal": "Before the conference meet, I had set out to repeat gold medals again, or at least only lose to other Calvin uniforms.  This clearly did not happen, but I see the 5k as an overall positive step on a day where I felt generally tired.",
        "turnpoint": "The turning place was right around 3k I think, where Weimer slowed WAY down and Ditri took over.  I should have tried to go with him, but I didn't and so he escaped.",
        "attitude": "6",
        "effort": "8",
        "date": 1557794273337
    },
    {
        "ID": "Noah CummisfordMSU",
        "name": "Noah Cummisford",
        "meet": "MSU 2019",
        "event": "1500m",
        "thoughts": "I was not engaged in the race at all. I need to do better.",
        "positives": "Nothing positive. I need to be mentally stronger.",
        "goal": "I set out to PR, and I did not even get close. From now on I need to really focus on sticking with the pack in every workout and race.",
        "turnpoint": "After the first 200m I started to fall off, and I fell off.",
        "attitude": "4",
        "effort": "3",
        "date": 1557592941974
    },
    {
        "ID": "Tyler JohnsonMIAA Championship at Hope",
        "name": "Tyler Johnson",
        "meet": "MIAA Championship at Hope",
        "event": "1500m",
        "thoughts": "A race of bad tactics where too much energy was spent on worrying about poor positioning and not much was spent on actually doing anything to better my position until it was too late.",
        "positives": "(+) I finally escaped my trapped location, albeit to late.\n\n(+) I tried to keep my teammates engaged in the race.\n\n(-) Positioning.  I never put myself in a position to win, and that is what ultimately killed me.",
        "goal": "My goal was to win and to lead my teammates into good finishes, and I fell far short on both accounts.  I am much better than fourth, especially after winning the mile indoors and being the returning 1500m champion.",
        "turnpoint": "While the turning point was 500 to go when everyone took off, I had already lost the race before then because I did not make myself escape the trapped spot that I was in.  I think I could have placed higher either by going out hard from the gun with the dumb Trine kid or by going around Vreeke or by telling him to scoot over for me.",
        "attitude": "7",
        "effort": "8",
        "date": 1557794273338
    },
    {
        "ID": "MIAA Conference ChampionshipsSimon Detmer",
        "name": "Simon Detmer",
        "meet": "MIAA Conference Championships",
        "event": "400m",
        "thoughts": "I gave that race my all. I ran as my coach had instructed me: run a 29 second 200m, then run as hard as you can for the next 100m, and then finish. I ran a 28.8 second first 200m, ran well for another 75m, and then got tired and finished rather slow. I could hardly keep myself in my own lane in the last 100m because I was very tired. I started the race leaning too far forwards which wasted some energy. My right arm moved for the first 225m. Overall, I believe that the race went very well. I broke my PR by 1.65 seconds and the T37 U20 national record by .23 seconds, so I am pretty happy.",
        "positives": "I ran a good first 200m and held on during the 200m-300m for a little longer. I need to work on running more relaxed.",
        "goal": "I did not break 60 seconds as coach Otte had wanted me to do, but I ran faster than 1:02 which was a dream goal for the last few years.",
        "turnpoint": "The turning point was at the 200m mark.  I decided then and there to give the last I had as Coach Otte instructed.",
        "attitude": "10",
        "effort": "10",
        "date": 1557794273339
    },
    {
        "ID": "Noah CummisfordDr. Keeler 2019",
        "name": "Noah Cummisford",
        "meet": "Dr. Keeler 2019",
        "event": "1500m",
        "thoughts": "I ran a very good and smart race.",
        "positives": "I won the race and PRed, and I ran a very smart race. I still need to work on being more competitive in the middle of races.",
        "goal": "I set out to run hard and do my best, so I did that.",
        "turnpoint": "At the start I made a decision to stick with the pack no matter what, and at about halfway I was able to start moving up because of that. With 200 to go I was in 5th and I really wanted to start passing people, but the dang people in front of me went into lanes 2 and 3 on the curve. I decided to tuck in and make my move with 100 to go instead, and I ended up winning. It was kind of weird because I just decided to go faster and nobody else did, and it was also weird because I won from lane 4 or 5.",
        "attitude": "10",
        "effort": "9",
        "date": 1557794480078
    },
    {
        "ID": "Jamison KoemanDr Keeler",
        "name": "Jamison Koeman",
        "meet": "Dr Keeler",
        "event": "5000m",
        "thoughts": "It went pretty well. I moved through the race well and ran a solid time.",
        "positives": "+ built a positive race\n+ very relaxed the first half\n\n- I should have started up about five guys higher instead of going out in the back because I had to cover a break 800 in that I wouldn’t have otherwise had to cover\n- lacked the confidence to continue passing people at 3k\n- I should have finished stronger, the guys who I was with at 400 to go gapped me by 5 seconds over the last lap",
        "goal": "Mostly, I wanted to have a positive race that would set me up to try to get as close as possible to qualifying next week. But I was hoping for mid to low 40s.",
        "turnpoint": "No real turning points but just a solid moving through the whole time. I guess one important spot was at around 3k we started slowing down a bit and I didn’t have the confidence to go around the guy I was with. So I definitely think I lost a couple seconds there.",
        "attitude": "9",
        "effort": "9",
        "date": 1557794480081
    },
    {
        "ID": "Jacob PettingaKeeler",
        "name": "Jacob Pettinga",
        "meet": "Keeler",
        "event": "10000m",
        "thoughts": "The first lap I was in last. people really like to go out hard. my first lap was a 78 one second slower than my goal pace of 77. I just relaxed during the beginning of the race and eventually took the lead of my pack clicking off 77's without even trying. When 5k passed someone yelled 16:07 and I knew that it was going to get painful soon. I kept waiting kept on the 76-77's. I waited and waited for the pain to come and it never did. during the last lap Diemer yelled, \"you need a 65!\". I thought shit that is not going to happen. I picked it up slightly. During the last turn i was on a full on sprint. I saw the clock 31:58, 59, 01, 02... I stopped my legs barely had any lactic in them. \"I did not go hard enough\" i said to myself.\n\nIt was a good 10k debut and I can walk away from my RS junior year despite breaking my foot and be content with it but wanting more. \n\nI am still dreaming of an injury free year where I run the way I should.",
        "positives": "good debut, ran smart but ultimately didn't reach my potential.",
        "goal": "no. yes.",
        "turnpoint": "when the race was breaking up I made sure I went with the people moving forward",
        "attitude": "10",
        "effort": "5",
        "date": 1557794480083
    },
    {
        "ID": "Jonathan EllisDr. Keeler Last Chance",
        "name": "Jonathan Ellis",
        "meet": "Dr. Keeler Last Chance",
        "event": "10000m",
        "thoughts": "I’m pretty disappointed. I ran to qualify, and that didn’t happen. I know I still have a chance, but it still sucks. The race went out slow, I was really inefficient, and I paid for it late.",
        "positives": "+ I went for it\n+ I made the moves I thought I had to\n- I was VERY uncomfortable early with my positioning which made me very inefficient\n- I had a lot of trouble building mental positives when I was hurting so early and when I fell off",
        "goal": "No I didn’t. My goal or qualifying would have been very difficult given the way the race played out. There were so many pace changes early which wasn’t great, but I wish I could have at least stuck with Baldonado and Engberg who ran 30:50",
        "turnpoint": "~1k - Dan O’Keefe took our pack and started pacing us at 73s. I went with him a long with a few others\n~4500 - I started to feel bad. I kept sticking.\n~7k - I started to feel horrible, and every time we lapped someone was a fight to stick as a small gap formed\n7800 - I finally fell off and started dying. I tried to work with whoever passed me when that happened.",
        "attitude": "8",
        "effort": "9",
        "date": 1557794480081
    },
    {
        "ID": "Addison SmithKeeler",
        "name": "Addison Smith",
        "meet": "Keeler",
        "event": "Steeple",
        "thoughts": "Really happy with this one. I was in the zone. The hurdles were going really well and I just kept building momentum throughout. Diems kept telling me to get someone over the water and I kept making plays. I got really out of it around 600-800 to go. The eyes went tunnel vision, but also zoomed out a bit, and a bit blurry. It freaked me out because that's never happened like that and the focused switched more to making sure I got over every hurdle in the last bit so I could finish off the really great race I was having. (It was especially bad in the last 400) Bummer that it had to finish like that, but I made it through without biffing and totally losing all my time. Eat more or electrolytes or something. If it comes back next race it won't catch me off guard as much, but it made it difficult to finish it off when my brain was definitely off some how. I'll just know that its there and just stay focused on the task at hand of finishing out the race and not be in safety mode more as well.",
        "positives": "-Hurdles were beautiful, best they've been in IDK how long\n\n-Made really good moves around people\n\n\n-I got to finish the thing come hell or high water\n\n",
        "goal": "I was looking for sub 9:35, but it was another step in the right direction and I can't be mad at a season's best, especially with whatever was going on in the last 2 laps with my eyes and head.\n\nProcess goals I had before the race:\n\nI was efficient in space\n\nI attacked the hurdles\n\nI didn't let people go, except for that last 130m with Aquinas\n\nI was cognizant of my goal to made a gutsy move at 800 and I went by that Aquinas guy. The gutsy moves were more around 1200 to 1000 to go, but hey, it was there and it was awesome to do and feel.\n\n",
        "turnpoint": "With 700 to go I made the pass on Aquinas. I let him get around me too easily. Should've fought for my position better, because I had to slow a touch to get back around him again.",
        "attitude": "9",
        "effort": "9",
        "date": 1557794480082
    },
    {
        "ID": "FredDr. Keeler Last Chance @ NCC",
        "name": "Fred McWain",
        "meet": "Dr. Keeler Last Chance @ NCC",
        "event": "10000m",
        "thoughts": "I'm happy but conflicted with it.  In a 48 man field, I basically solo'd it.  No one really went my speed for the 1st 5k, not even me.  I wanted to go 16:20 through halfway, but was like 16:31.  My body had a lot of energy, I just never really hit splits or felt super engaged.  Regardless it was a fun race, I started latching on to people who were lapping me trying to qualify for nats and running like 2 minutes faster, and I'd give it a couple strides with them just to pick off a couple seconds here and there.  Rylaarsdam passed me at one point and I thought he wasn't going that fast so I stuck on him for like 800m before I let it go.  My upper body felt super constricted and with 9 laps  to go I really wanted to throw up, so I kept feeling out every lap, waiting for it to happen, but it never surfaced, and eventually I found myself needing a 72 to go sub 33, so I started to pick it up, right around 150m to go I threw it into final gear and kicked it home pretty hard.  Happy with a PR, especially when my full boy wasn't working with my legs.  Good note to end the season on, some momentum for the summer.\n",
        "positives": "(+) I PRed and ran relatively fast when my body was still a bit jank\n(+) My legs felt like they had a lot of pop and recovered well from a DEEP 5k 6 days prior\n(+) Ended the season on a positive\n(-) never really engaged in the race or totally invested to break the bank",
        "goal": "Goal: sub 33? yep\nGoal: 32.40 pace? no.  I do think this was realistic if I didn't have a jank upper body/back.",
        "turnpoint": "1 lap in: the people who I went out with were slow, so I hopped outside of them and took the drivechain of my race.\n9 laps to go: I started feeling myself want to throw up, so I played it lap-by-lap and focused on keeping the pedal down a bit, but not to force myself to vomit.\n9700: Diems yelled out 32:07 and I threw down a 51 last 300 to close it out.",
        "attitude": "8",
        "effort": "6.5",
        "date": 1557794480082
    },
    {
        "ID": "Tyler JohnsonDr. Gregory Last Chance Invitational",
        "name": "Tyler Johnson",
        "meet": "Dr. Gregory Last Chance Invitational",
        "event": "1500m",
        "thoughts": "A fitting end to a tumultuous outdoor season.  Won the heat leading wire to wire with no real competition in a mediocre time.",
        "positives": "(+) Finally competed to the end of a race and won in the outdoors\n\n(+) Felt like I could have definitely PR'd in the 1500 with literally ANY competition\n\n(-) I could not lead a fast race; need to get better at leading",
        "goal": "My goals were to win my heat and to PR and to stud list.  I was 1 for 3, but feel like I could have achieved the other 2 with a better field",
        "turnpoint": "The turning point was lap 3.  I did not maintain my quick cadence that could have led me to a PR, as I had no competition.  I did not able to force myself to lead fast enough, which slowed me down considerably.",
        "attitude": "9",
        "effort": "8",
        "date": "1558997471132"
    },
    {
        "ID": "Tyler JohnsonDr. Keeler Last Chance Invitational",
        "name": "Tyler Johnson",
        "meet": "Dr. Keeler Last Chance Invitational",
        "event": "5000m",
        "thoughts": "My best race of the season up to this point.  Not anywhere near the time I wanted, but competed through 3k with guys that would go on to qualify on the day",
        "positives": "(+) I competed for a long time in a race that I didn't have good momentum for going forward\n\n(+) I felt like I was on the way out of my slump\n\n(-) When I hit a wall, I hit it HARD and did not do well in salvaging my race",
        "goal": "My goal for this meet was an outside shot at qualifying.  I did not get near that.  It was an outdoor season best, but one that still paled in comparison to what I thought I could do after outdoor",
        "turnpoint": "3k.  I hit a wall, and the fatigue that I have been feeling all outdoor season washed over me once again and I faded hard.",
        "attitude": "7",
        "effort": "8 first half, 6 after the wall",
        "date": "1558997181395"
    },
    {
        "ID": "Jamison KoemanGregory",
        "name": "Jamison Koeman",
        "meet": "Gregory",
        "event": "5000m",
        "thoughts": "I went in thinking it was qualify for nationals or die trying. Probably a poor mindset for me. The mind and body weren’t there. I felt comfortable through halfway running 70-71, but then the move was made around 3k and I couldn’t go with it physically or mentally.",
        "positives": "+ good positioning\n\n- this was just a bad race overall",
        "goal": "No, I think I set myself up for failure mentally. I race best when I just race, not when there’s some qualifying mark on the line",
        "turnpoint": "3k - fell off",
        "attitude": "8",
        "effort": "7",
        "date": "1558994876133"
    },
    {
        "name": "Addison",
        "meet": "Bucknell",
        "event": "Steeple",
        "thoughts": "I'm frustrated because I prepared really well for this mentally and physically I felt like I was ready to take a really big step. Visualization was there, I understood the magnitude of the opportunity, I was ready to go get it. We get into the race and I wanted to make sure I got out well, better than MSU and in a position to pass after being patient. I was on the rail to start, and I wanted to just relax, do my best to beat see the hurdles and hurdle as efficiently as possible early. It felt like I was right in the middle of the clusterfuck, which regardless is something that I need to get better at handling. It was hard to relax because of it, and eventually I got out but not before the packs spread out and I was in the back which felt like a negative when I came in with the expectation of being in the front competition for the win. More patience, poise, and positivity needed during these times, because it really threw me off. ",
        "positives": "Positive: \n\n-It was a perfect opportunity to fully recognize a glaring weakness in my steeple arsenal and now get better an positioning myself at the start of the race as well as hurdling in tight position\n\n-I really do feel my legs were coming around last week, which is a great sign for the future when I recover from this one\n\n-Another 35 barriers\n\nWork on: \n\n-I didn’t put it together today, which sucks for me and everyone else.",
        "goal": "Nope, I wanted at least a 9:35.\n\nI wanted to compete for the win.\n\nI gotta learn, stay positive, keep believing and striving for excellence.\n\nWe are gunna get there if we keep attacking.",
        "turnpoint": "Then I got clipped on a jump and fell which pissed me off. I was happy that I at least took it in stride and kept fighting to build positives while chasing the group back down. I could hear the squad on the turn and I fought to salvage everything I could in the last few laps, I really appreciated them there. It helped that there were a couple guys to chase down as well.\n\nI have to attack the hurdles always,\n\nBuild on positives throughout the race\n\nRecognize that its an imperfect race and keep going after it\n\nPosition myself in a place where I can compete, move through, and not let myself get jostled around\n",
        "attitude": "8",
        "effort": "8",
        "ID": "AddisonBucknell",
        "date": 1557437883034
    },
    {
        "name": "Jack Randall",
        "meet": "Golden Grizzly Invite",
        "event": "1500m",
        "thoughts": "This was a fun race for me. I wanted to really focus on competing and not try to worry about time in an event that is considered to be a little short for me. On top of that, the wind was gusting upwards of 30mph, which wasn't exactly going to make for a PR day.\n\nThe race went off and I immediately snugged my way into the back of our 12 man heat. I really didn't want to take the wind early in the race. Once we hit that first turn, I knew I had made the right decision as the whole pack slowed down noticeably. I could feel wind heavily beating my chest, despite being behind 10 guys. Once around the curve and mostly out of the brunt of the wind the pace seemed to pick back up. We came through 400m in about a 71 I believe. At this point there was already a gap forming in front of me and I knew I had to fill it. This was only a 1500m, so the margin for error was slim. I sat at the back of this new pack for another lap, and we came around through 800 in about 2:22. This is where the pace definitely picked up perceptibly. A new gap had formed, with two guys going out the front of the pack hard. Nobody went with them, and I chose not to as well. I believed that I could close hard, but that making the kind of move with 700m to go would probably be unwise for me. Another 100m later and they had significantly put room on our pack, and I was reassured of my decision to play it cool when they went. 600m left in the race and I was feeling it. My guts hurt, my lungs hurt, and my legs hurt. Truly a triple threated trifecta of pain. This was my race decision moment. I could either fall off the back of my pack, or stick it out. I remembered what I had said to William the previous day. \"Make sure that you make it a race at the end if you want to finish strong\". I grit my teeth and resigned to make it through the wind to the 400m to go mark. I could make this a race. I could. Coming out of the wind and down the straightaway towards the clock I hung tight at the back of our six man pack. The two guys who had gone hard with 700m to go were far and away, and I knew that a move to try to catch them would be pretty foolish and leave me tying up down the home stretch, however; I was determined to finish as high in this heat as possible. Down the back stretch just after 300m to go I made a move past a SVSU guy who was tying up. I snugged back in behind our new smaller pack for the last bend to save myself from the wind again and prepare for an all out throw-down on the home stretch. I came out of the turn wide into lane 3 so that I'd have a clear shot at the line, and shifted into my last gear. I pushed past one guy almost right away. I definitely caught him by surprise, I'm not sure if he actually even knew I was there in the first place. Next on the menu was another SVSU runner. He wasn't going to be passed without a fight but I was simply moving faster than he was. A dork from Red Cedar Running Club (the short one) fell victim to me with about 50m to go as well. I think that this is the 3rd time I've kicked him down in the final 100m of a race. I almost felt bad. Finally I came up on a runner from Detroit Mercy. This guy was hauling, and as soon as I clipped into his periphery he was able to find another gear and hold me off for the remaining 20m.\n\nI was breathing hard and my stomach hurt really bad, but I was pretty proud of that race. I ran tough and was focused on the race situations around me. Most importantly though, I did not put myself out of the race when I wasn't sure I was gonna make it. In fact, I took the risk to put myself right in it and it payed off. I think that this will be huge confidence booster for me going into next week at GVSU where I'll be able to take a shot at the 1500m again with hopefully some better conditions. Rick Otte said that it was the best 1500m he's ever seen me run. He is an honest guy so I appreciated hearing that from him. Shortly after he said that I had to do my best to jog off the infield to puke my brains out :)",
        "positives": "+ finished strong\n+ ran tough in an event that feels fast for me\n- Could have played it a little less safe in the first half",
        "goal": "I wanted to compete in my heat and I definitely achieved that by finishing 3rd overall in it.",
        "turnpoint": "600m left in the race and I was feeling it. My guts hurt, my lungs hurt, and my legs hurt. Truly a triple threated trifecta of pain. This was my race decision moment. I could either fall off the back of my pack, or stick it out. I remembered what I had said to William the previous day. \"Make sure that you make it a race at the end if you want to finish strong\". I grit my teeth and resigned to make it through the wind to the 400m to go mark. I could make this a race.",
        "attitude": "9",
        "effort": "10",
        "ID": "Jack RandallGolden Grizzly Invite",
        "date": 1557437883035
    },
    {
        "name": "Caleb Ferguson",
        "meet": "Bucknell Bison Invite",
        "event": "Steeple",
        "thoughts": "It was a very frustrating race for me. I felt out of rhythm on the barriers and like they were working against me. I was so ready for this race mentally and physically, but I wasn't prepared for my hurdles to be bad. Overall it is still a step in the right direction, but it was not the step that I wanted or the one that I am capable of right now.",
        "positives": "+I closed the race well despite being pretty far out of any meaningful competition at that point.\n+I took another step in the right direction overall.\n-I did not qualify and break 9 both of which I felt I was capable of before the race. This is so frustrating ahhh.",
        "goal": "No. I set out to qualify first of all and second of all to run sub 9 minutes. They were both very realistic if I had hurdled well because I have beaten the GV dude who won a few times before.",
        "turnpoint": "The first turning point was getting out in last place. I meant to get out behind the bubble but it turned out to be the whole field. I responded by trying to get reconnected with the group but I was hurdling badly so I was doing that by running faster between the barriers. \n\nThe other turning points were just times where the pack was getting away from me, and I tried to go back up the first few times but my hurdles just kept sending me back and so eventually I stopped trying to catch them.\n\nOne positive turning point was catching a dude Addy told me to go get and how I finished with intentionality despite what had been a bad race which I don't usually do.",
        "attitude": "going in 10 during 7",
        "effort": "9",
        "ID": "Caleb FergusonBucknell Bison Invite",
        "date": 1557437883035
    },
    {
        "name": "Fred McWain",
        "meet": "Rhodes Invite",
        "event": "10000m",
        "thoughts": "This was a fun race.  33:04.  I went out in a  16:45, which is what I closed my previous PR in, and I was suuuper comfortable with it.  In my head I wanted to take over the work load and I had to have Leb and my brain tell me to let Addy pull it along because it was a tempo for him and a race for us.  The 2nd half Addy pulled away and Charlie went with, but I worked from a positive place and put in a long drive from 1200 out to close well and my 2nd 5k was a 16:19, 9 seconds off my 5k PR.  Solid Race, could have run faster with a strategy geared towards the other group, but a lot of positives taken away and a neat new PR.\nThere were several points in the race where I could have mentally given it in, and I was close, but none of it manifested.",
        "positives": "I massively negative split and still finished with fuel still in the tank.\nI was able to focus even in the midst of our pack splintering and me not being the one pushing it, something I've struggled at before.\n\nI need to be more confident in my ability.  I've shown the potential now, and its a matter of executing with some moxie in racing.",
        "goal": "I would say that I did.  I was thinking about anywhere from 32:45 to 33:00 and I was 33:04 with a dang slow first 5k.",
        "attitude": "8.5",
        "effort": "8",
        "ID": "Fred McWainRhodes Invite",
        "date": 1557437883036
    },
    {
        "ID": "Jim VanDykeAl Owens",
        "name": "Jim VanDyke",
        "meet": "Al Owens",
        "event": "1500m",
        "thoughts": "As sad as being done with running makes me feel, I'm glad I got to go out on my own terms.  This race was so hard. My body completely rejected the idea of running, I literally started dry heaving 500 meters into the race lol. My hip didn't really bother me, but Al said my stride looked off, so thats not surprising. It got pretty bad after the race, but that's what happens after every run. I wanted to stop running so bad, and I knew nobody would question it cause of my hip, but I couldn't do that to my teammates or to myself. I knew if I got to 800 I would finish, so I just kept going. I think if it hadn't been so fricking windy I could have run a lot faster, but whatever.\nI have experienced so much in college running, and I would love to have had it go differently. But at the end of the day, life isn't fair, so I have to be the one to create the value out of the experience. SO MUCH SUCKED, but there are lot of positives running brought me. I will miss this team so much next year, and who knows what the future of running is for me.\nI want to thank every coach who ever taught me anything, or ever believed in me. I would not be the runner or man I am today without it.\nI also want to thank every teammate I've had. Anyone who ever pushed me in a workout or race, or encouraged me after a bad one. Thank you to anyone who ever kept me company in the stupid depths of a pool or lake, or during the mind numbing monotony of the bike. Thanks to everyone who laughed at my dumb jokes, and put up with me in my bad moods. I love all of you so much, as you guys are one of the highlights of college running for me. I never accomplished what I wanted to, but at least I made some damn good friends. Keep grinding, for yourself, and for me. \nIf you can learn one thing from me, NEVER FUCKING GIVE UP ON YOUR DREAMS. You are all so capable of greatness.",
        "positives": "+Being healthy\n+not torn labrum\n-I shouldn't want to drop out",
        "goal": "Yes. I just wanted to finish college running on my own terms. I love you all",
        "turnpoint": "500 in. I was dry heaving and wanted to stop. But I knew I couldn't do that so I kept going as best I could",
        "attitude": "8",
        "effort": "10",
        "date": 1557437883037
    },
    {
        "ID": "Noah CummisfordAl Owens",
        "name": "Noah Cummisford",
        "meet": "Al Owens 2019",
        "event": "1500m",
        "thoughts": "I was able to compete the entire time and finish really hard. Good race, but not the greatest. I should have worked harder in the second lap.",
        "positives": "+I out-kicked a guy who was right next to me the entire last 100m\n+I stayed engaged on lap 3\n-I need to be more comfortable running faster in the beginning of races",
        "goal": "I wanted to do everything I could to compete and not fall off, and I think I did that pretty well.",
        "turnpoint": "During the third lap I had to decide whether to give up or stick, and I chose to stick on the guy in front of me.",
        "attitude": "8",
        "effort": "7",
        "date": 1557592941975
    },
    {
        "ID": "Jamison KoemanBucknell",
        "name": "Jamison Koeman",
        "meet": "Bucknell",
        "event": "10000m",
        "thoughts": "I went out comfortable, was antsy from 5k to 7k and then couldn’t go with the pace change when it happened around 7k.",
        "positives": "+ went through 5k comfortable\n+ finished the last lap relatively hard\n\n- I should’ve expected that shifting gears after 7k wouldn’t be easy",
        "goal": "I set out to run 30:30 and throw my hat in the ring for a nationals qualifier. I didn’t come close",
        "turnpoint": "7k - legs just didn’t have it and I was surprised by how terrible my legs responded. I think that pace change not only gave me a physical hit but also a mental hit. This week, my legs had just started to feel bad in workouts, so that might have something to do with it.",
        "attitude": "9",
        "effort": "8",
        "date": 1557437883049
    },
    {
        "ID": "Justin VarineauBucknell",
        "name": "Justin Varineau",
        "meet": "Bucknell",
        "event": "5000m",
        "thoughts": "This was a toughie. Right from the start, the pace seemed hot, and we weren't even going that fast. I'm disappointed in myself for not trying to stick on the last dude that passed me, because once he was gone, I was on my own for the last 6 or so laps. ",
        "positives": "+: My mindset going in was good. I hadn't been all that confident in the days leading up to it, but in the moments before the race, I was expecting a successful race.\n\n+: In the first 2k, I made moves to cover gaps. Though these gaps reformed, I'm happy with my temporary covers.\n\n-: My focus the last 2k. Very bad. When I'm in that situation again, I need to hang on for all it's worth.",
        "goal": "No. The goal was to be mentally rock hard and put in a PR performace. 'Twas not the case.",
        "turnpoint": "I think the turning point was when I started falling off the main group. From then on, it was just a battle of reengaging and sticking with the people going by me. I don't think I handled it all that well. Looking back, I wish I had developed a \"one lap at a time mindset.\" When I looked at all the laps I had remaining, I thought to myself, \"shoot, I can't stick with these dudes for that long.\" If I had raced one lap at a time, I would've been a lot better off.",
        "attitude": "5",
        "effort": "5",
        "date": 1557437883050
    },
    {
        "ID": "JamisonAl Owens",
        "name": "Jamison",
        "meet": "Al Owens",
        "event": "1500m",
        "thoughts": "It was okay. Tactics were terrible, I should not have started in last if I wanted to be competitive up front. Fighting sickness right now - slept between 10 and 11 hours the night before and laid down for about 2 hrs at the meet - so my body really lacking the energy that I needed to run well. But on the positive side, I think racing today was a good choice in order to prepare me for hillsdale. Super proud of the guys in my race for kicking butt.",
        "positives": "+ ran a building race that gave me some speed and will set me up for hillsdale\n\n- tactics\n- my kick was pretty lame",
        "goal": "No I wanted to win the race. Made a major error at the start. Still, don’t know if my body could’ve accomplished that today.",
        "turnpoint": "I was just feeling a little off from the gun. Still shouldn’t have gone out in last.",
        "attitude": "7",
        "effort": "7",
        "date": 1557437883050
    },
    {
        "ID": "Fred McWainAl Owens",
        "name": "Fred McWain",
        "meet": "Al Owens",
        "event": "1500m",
        "thoughts": "This was one of the best races I've ever had. I'd have to rank them, but definitely top 3. I got out in about 5th to last, kind of where I expected to be, but it felt pretty comfortable. I was halfway between tucking in behind in the wind and going out into lane 3 because I felt too quick to just sit. We went through 400 in 68 and 700 in 2:00, at this point, when there was 750 to go, a gap opened up in between 2 people in front of me, and I instinctively threaded between them and just started moving past people, I didn't really think about the wind and with 400 to go I was in the front 5 and just took the lead and here I absolutely went to the well. I knew the backstretch was freaky fast so I tried to notch down another gear here, but some guy had better flat speed than me, and when I came around the corner with 150 to go, Addy was on my shoulder, and he just had more to give than me. I really gave everything else the last 100m and held off whoever else was behind me and finished 3rd overall. \n\nEverything in this race proved something for myself at conference",
        "positives": "(+)I proved that I can deal with hard moves in races\n(+)I competed in a field that was straight up better than me on paper, and raced my absolute heart out\n(-)I was probably too conservative at the start",
        "goal": "Yes.  I blew some fools out of the water kicking the last lap (yes I struggled the last 100, but only 2 people in that race beat me the last 800m, 1 of which is a cross country all american).  \nI proved that I can compete with some guys who are better than me on paper.  I raced for the win.",
        "turnpoint": "-750m to go, I saw an opening and made a hard move and shredded my way through the field from ~16th\n-400m to go, I took the lead and pushed even harder, especially on the backstretch\n-100m to go, I was pretty bankrupt, but every ounce in my body pushed towards getting through the line",
        "attitude": "10",
        "effort": "10",
        "date": 1557437883050
    },
    {
        "ID": "Addison SmithAl Owens",
        "name": "Addison Smith",
        "meet": "Al Owens",
        "event": "1500m",
        "thoughts": "Very happy with this one. It was fun to compete up in the front, making good passes and closing gaps all the way through. Great set-up race for what's to come!",
        "positives": "Positive One: I got out better that I did at Bucknell. There was a tall guy that spent to much time trying to elbow my to the rail and not on his race and went quickly out the back, but still put me in a less that optimal position, but I got out pretty unscathed to the shoulder, and was still in 7thish\n\nPositive Two: \n\nI just kept improving my position and feeling in total control, it was so dope. Because the race slowed way down on the finishing stretch I thought to myself, \"Damn this is a 1500, and I feel good right now what is this????\" We got out really hard and that hurt, but I recovered quickly.\n\n\nWork On: \n\nGetting out even a bit harder maybe, but overall it wasn't that bad of a spot.\n\nMaybe it was moving up a little earlier, but I mean I was right on the leader with 400 to go. \n\nI don't know, I can't really say there's a whole lot to work on here. The race went out really slow which made the time slow, but the body was there and it was a blast.",
        "goal": "I had multiple goals:\n\n1st: to win (nope), but 2nd place and the way I ran it was great\n\n2nd: to get out strong, but efficient (a little bumping, shoving, and slowing down to get out, but overall that was accomplished)\n\n3rd: move through the field (big yup)\n\n4th: be in the lead pack with 400 to go (yup)",
        "turnpoint": "When Fred passed me with a lap to go, I was like \"Holy Shit it's FRED?!?!?!\" Right before this I was slowly making my way up to the leader and getting ready to make a decisive move to go all in. He passed me, and the eventual winner from Oakland did as well. He caught me so much by surprise that for a hot second I might have lost my concentration and didn't get wide to get right on him, or the move was hard enough and the Oakland guy was on him enough that I had to wait a touch to get around. Whatever the case, I wish I got out because someone, whether the guy in neon who was in the lead or one of the other guys slowed WAY down and I had to slow down and get around him and Fred+Oakland. After that I did my best to claw them both back. \n\nI think it pretty bad timing for the leader to eat shit as Fred and the Oakland guy got by me. If I felt them earlier I would've got wide to block them and get around neon first so I didn't get revolving doored, but koodos to Fred for the HARD move.",
        "attitude": "9",
        "effort": "9",
        "date": 1557437883051
    },
    {
        "ID": "Caleb FergusonAl Owen's",
        "name": "Caleb Ferguson",
        "meet": "Al Owen's",
        "event": "1500m",
        "thoughts": "I did everything correctly. I have no qualms with what I did whatsoever. I just wanted to have a last gear.",
        "positives": "+I got out well and competed the entire race.\n+I took it when I thought I had a chance to go and win and set the tone for the rest of the races.\n-I didn't have that last gear that I think I will need to win a national championship.",
        "goal": "I set out to compete really hard and run a smart race. There was nothing about time or anything else in my head, just controlling space and competing. I did exactly that.",
        "turnpoint": "Turning points were getting out well, did that. Then moving up on the far side straight away, which I did. Lastly was the decision to go to the lead and take it at just after 400 to go. It honestly wasn't even a decision because I had decided so firmly before hand that I would do it if I was in the lead pack.",
        "attitude": "10",
        "effort": "9",
        "date": 1557437883051
    },
    {
        "ID": "Jack RandallAl Owens",
        "name": "Jack Randall",
        "meet": "Al Owens",
        "event": "1500m",
        "thoughts": "Frustrated with my race tactics. Let myself get trapped going into lap 3 which put the hurt on my move. Passed the guy in lane zero (infield) and closed on a lot of people but it was too little too late.",
        "positives": "+Finished Strong\n+Got out well\n-Didn't protect my position in the middle of the race",
        "goal": "I was able to get a good race effort in despite the time not quite being what I wanted. I also feel like I have set myself up well for Hillsdale.\n",
        "turnpoint": "Got boxed in and panicked. Couldn't make up my mind quick enough about what to do and put myself out of the race mentally.",
        "attitude": "8",
        "effort": "8",
        "date": 1557437883052
    },
    {
        "ID": "Nathan klaassenAl Owens",
        "name": "Nathan Klaassen",
        "meet": "Al Owens",
        "event": "5000m",
        "thoughts": "Was fourth in the heat sheets when I saw them and wanted to win my heat. A lot of the guys in my heat were people who I had beaten at MSU. With the high wind speed though I had to adjust my race plan compared to the plan I had at MSU. Before the race Diemer emphasized that I had to get a good position early in the race but be patient because of the wind. First mile was easy as I had good position and pace went out much slower than other 5k's (5:25-5:30). Pace started to increase as one by one each person would make a move to the front but then fall back because of the wind. Meanwhile I stayed consistently between 4-6th place right behind the leaders. With 4 laps to go let to a gap form after the pace surged and didn't cover it. Then fell off at 3.5 laps. Hung around 2nd pack of runners for 2 laps then fell off that pack and then caught one of those runners in the 2nd pack who had also fallen off in the last 100 meters.",
        "positives": "Good position throughout race.\nBeing patient and not taking the lead early when there was a lot of wind\n\nNeed to stick better in last mile",
        "goal": "Wanted to win the race, a lot of the guys that beat me were guys that I had beaten at MSU. \nHave to bring it more and respond better when other runners make their moves.",
        "turnpoint": "3.5 laps to go fell off of the front pack that had 4-5 guys. Didn't react well when the pace started to surge between 4-5 laps to go.",
        "attitude": "7",
        "effort": "7",
        "date": 1557437883052
    },
    {
        "ID": "Ryan VreekeAl Owens",
        "name": "Ryan Vreeke",
        "meet": "Al Owens",
        "event": "1500m",
        "thoughts": "The effort and focus that I gave in the race was a very positive side in the race. It was a bummer that I was in the second heat as I believe being in the first would have helped me run a faster time.",
        "positives": "One positive was I stayed in a pack in order to work with them and the second positive is when I decided that I had enough to start and go at the last 400 with everything had. I can work on getting out in a better position that way when I make a move I don’t have to jump out the of way in order to start making my move and waste energy.",
        "goal": "I achieved what I wanted to do because I ran a focused race where I ran a decent time and set myself up with confidence in knowing that I can run a better race in the future.",
        "turnpoint": "Just before the last lap to go I knew that we were going at a pretty slow pace and so I needed to get out around people and give all of the rest of my energy in order to run the fastest time I could.",
        "attitude": "9",
        "effort": "9",
        "date": 1557437883052
    },
    {
        "ID": "Mica MeindertsmaGVSU Al Owens",
        "name": "Micah Meindertsma",
        "meet": "GVSU Al Owens",
        "event": "1500m",
        "thoughts": "I ran well this week, way way better than last week. I got out well but I still need to keep focus in the middle of the race. I could have run faster if I had. However I was able to finish really strong and pass and hold off a lot of guys in the final 200. ",
        "positives": "I got out well and stayed out of trouble and I finished as well as I have all season. I still need to stay focused in the middle of the race however.",
        "goal": "Yes",
        "turnpoint": "The turning point in the race was with 350 meters to go and I got passed by a Hope guy and I was able to reengage and start sprinting. ",
        "attitude": "10",
        "effort": "9",
        "date": 1557437883053
    },
    {
        "ID": "JasonGrand Valley - Al Owens",
        "name": "Jason",
        "meet": "Grand Valley - Al Owens",
        "event": "Steeple",
        "thoughts": "I really just don't know how it ended up so badly. Went out comfortably behind the traffic. But a couple decent hurdles put me into traffic and I had a couple not great hurdles, then I fell on the second lap, but got right back up after a roll and lost maybe 10-15m, I don't know exactly. Over the next lap and a half, I made it back to where I was before and pasted a bunch of people with some really good hurdles. I felt like nearly all of my dry hurdles were some of my best. But somewhere between a mile to go and 3 laps to go, I just hit the wall, and couldn't do much besides dig in and try to hold on. My hurdles were still okay, but I just couldn't keep up on the flat with the guys who were hurdling like idiots, it just made me so mad. While I think I'm not quite there physically and my legs need a bit more freshness in them. I also definitely psyched myself out thinking about the race the entire time I was at the meet. In hindsight, a similar thing for sure happened at Michigan State. I should have learned from that. I bet if the steeple is first I run faster, but I have no control over schedule, so that's always just an excuse. Moving forward, I guess I just have to drop more miles, and make sure I'm right in the pack and on the shoulder before I start to hit the wall.",
        "positives": "Hurdles were solid! Good some good practice in and water barriers.\nI just need to force myself to accelerate out of the hurdles and definitely work on the water barrier. I just leave my foot on it too long and don't push off enough and then bring down my leg to quickly and land two-footed. I need to get more comfortable with it.",
        "goal": "Goal 1: I wanted to drop a contending time in the conference. Not even fucking close and there wasn't even any wind.\n\nGoal 2: I wanted to prove to myself that I could hurdle as well in a race as I have been in practice/workouts. Did that at least.\n\n",
        "turnpoint": "Caught some guy's trail leg I think on a dry hurdle and fell on the second lap. Just kept running like normal and gradually got back to where I was. \n\nBad water barrier a bit of jostling out of the pit too, lost a lot of momentum, I started going out the back of the group and started to hit the wall.",
        "attitude": "4",
        "effort": "8",
        "date": 1557437883053
    },
    {
        "ID": "Tyler JohnsonGVSU Al Owens",
        "name": "Tyler Johnson",
        "meet": "GVSU Al Owens",
        "event": "1500m",
        "thoughts": "Good building race and a set up for next week. Wish I had had the confidence to go out harder, but my sickness mentally crippled the start of my race. Felt better as I went along in the race: the first two laps sucked, the last two felt like racing.",
        "positives": "(+) I felt better as the race went on and felt like a shook off some sickness.\n\n(+) I finished strong \n\n(-) I should have been in the mix of the top group from the gun. I ran with little comfidence and remembered thinking when Caleb made his move, “I hope he wins!”  That is NOT ok. I could have won the race, I should be making proactive moves, I should have believed that I had a chance, that it was MY race.",
        "goal": "I wanted to put down a seed time for conference and set myself up for Hillsdale.  Not very lofty goals, but I achieved them.",
        "turnpoint": "400m to go, the punk Hope freshman pulled up next to me on the inside.  I decided right then that I DO NOT LOSE TO PUNY HOPE FRESHIES WHO DO WORKOUTS DURING RACES.  Wish I had been jostled into making a move sooner though, because I could have.",
        "attitude": "6",
        "effort": "8",
        "date": 1557437883054
    },
    {
        "ID": "Tyler JohnsonBucknell Bison Invitational ",
        "name": "Tyler Johnson",
        "meet": "Bucknell Bison Invitational ",
        "event": "5000m",
        "thoughts": "The race simply didn’t mean enough to me. It should have, and I’m frustrated that I wasted an opportunity. Turns out after the fact that I was sick, but I was literally never engaged in that race and that’s not the kind of racing that my team deserves of me.",
        "positives": "(+) wasn’t nervous going against a huge field that was very good\n\n(+) I finally latched onto a guy and held onto him\n\n(-) I never engaged or competed or fought to do something special, I passively just let the race happen",
        "goal": "My goal was realistic. It was to qualify, by PRing by 7+ seconds from indoors on a nice big track with plenty of competition.  I never chased that goal, however, from the moment I started warming up.",
        "turnpoint": "Before the race. I had convinced myself before the race that it wasn’t going to be a fast race, despite having no reason to support that other than a sore throat. I defeated myself before even starting.  Looking forwards at Hillsdale, that will NOT happen again.",
        "attitude": "4",
        "effort": "4",
        "date": 1557437883054
    },
    {
        "ID": "Jacob PettingaGina relays",
        "name": "Jacob Pettinga",
        "meet": "Gina relays",
        "event": "5000m",
        "thoughts": "Thought it was fine",
        "positives": "I PRed, I kicked pretty hard I guess... 67 last 400\n\nDon't break your foot kids.",
        "goal": "No. Yes.",
        "turnpoint": "The pace picked up slightly to a tempo I didn't feel like I could sustain. I backed off the lead and let them go by. \n\nI don't know if that was a good move or not.",
        "attitude": "6",
        "effort": "8",
        "date": 1557437882994
    },
    {
        "ID": "Jamison KoemanHillsdale",
        "name": "Jamison Koeman",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "The attitude was there, the effort was there, but I seriously lacked brains. My game plan did not play to my advantage and my body started hitting lactic too early. I poorly estimated my window for that day. I don’t know how much the wind played into it but I didn’t feel it. If I could’ve run 71-72 for the first half instead of 69-70 I think I would’ve been able to finish off with a pr.",
        "positives": "+I went for it\n\n-be smarter",
        "goal": "I wanted to run 14:35 or pass out trying. Didn’t do either. I’m sorry I didn’t focus my attitude and effort towards a smarter game plan. I missed a good opportunity to use my attitude and effort to make a really important positive for myself. With the chances I have left, I will race smarter and make positives. I owe it to the team to finish this season off strong.",
        "turnpoint": "2.5k. Really started hitting lactic. I did what I could to hang on. 3k I fell off.",
        "attitude": "10",
        "effort": "9",
        "date": 1557437883055
    },
    {
        "ID": "Jack RandallHillsdale Gina Relays",
        "name": "Jack Randall",
        "meet": "Hillsdale Gina Relays",
        "event": "5000m",
        "thoughts": "A really good race for me and a season best. Not the huge PR that I \"usually\" get at Hillsdale but something to be proud of nonetheless.",
        "positives": "+ran hard with a determined attitude\n+held off everyone near me at the end\n-need to defend my position better from physical competitors\n",
        "goal": "Yes! I had a season best and have set myself up for conference very well!",
        "turnpoint": "I got revolving-doored after the first mile and a gap formed between myself and the pack in front of mine. I didn't let it psych me out and instead I slowly bridged the gap and worked with the guys around me to close it and still run well.",
        "attitude": "9",
        "effort": "10",
        "date": 1557437882994
    },
    {
        "ID": "Ryan VanAppledornHillsdale",
        "name": "Ryan VanAppledorn",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "This was my best race of the season. I ran 17:09 which was one second off my PR and I was able to stick with a pack and kick them all down at the end. It was my favorite finish of my college career and it was great to be able to have a race like this after my indoor and outdoor seasons being stuck on a bike and in the pool.",
        "positives": "I stayed in contact for most of the way even with a little back pain. In the last mile I could have probably stayed with my pack because I was able to kick them down from far away. The guys I kicked all closed in 81 seconds and if I had stayed with them I think I could have still beaten them. I am still happy with my kick anyways because it worked. So the two good things are I held on for the first two miles kicked well and I need to work on holding on in the last mile because I could have probably beaten those guys by even more.",
        "goal": "I wanted to PR today and I came very close to doing that. I am happy with how I did especially after months of cross training and very little running. There is so much more potential for me still if I can keep myself injury free. I proved to myself today that I will PR this summer and I will break 17 when I finally make 100% of my miles running miles.",
        "turnpoint": "In the last mile I started slowing down and I lost contact with my pack. In the last 600 meters I had to work harder to catch them again. I ended up kicking four guys down by closing in a 72. I beat two of them with less than a second to spare.",
        "attitude": "9",
        "effort": "9",
        "date": 1557437883055
    },
    {
        "ID": "Justin VarineauHillsdale",
        "name": "Justin Varineau",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "I shouldn't have been in the heat I was in, and that's on me for not talking with the coaches about that. I'm not at a place right now where I should be going out in a 2:58, and I paid for that in the last 3k of the race.\nThankfully, I'll be able to go out at conference at a pace I'm comfortable with, so that'll be a whole different ball game",
        "positives": "+: Mentality for the most part was good. I didn't give up and stayed mentally short for the majority of the race.\n\n+: I was still able to close the last 300 fairly well. Even though my legs felt trashed, I had more left, so that's reassuring.\n\n-: I need to go out in my window. That'll be the key at conference",
        "goal": "The goal was to make a step in the right direction. By going out harder than I should've, I didn't accomplish this, so I didn't really give myself an opportunity to attain my goal. Yet, by knowing where I am in my training, this race will better prepare me for conference.",
        "turnpoint": "When I fell off at around 2k. From there, it became a mental challenge of pushing myself (until Diemer told me not to strain).\nI think I reacted decently. I'm happy with the effort I put forth and happy with my effort to stick on Jon when he passed me. The body wasn't there, but I think the mind was.",
        "attitude": "7",
        "effort": "8",
        "date": 1557437883058
    },
    {
        "ID": "Caleb FergusonHillsdale Gina Relays",
        "name": "Caleb Ferguson",
        "meet": "Hillsdale Gina Relays",
        "event": "Steeple",
        "thoughts": "This race honestly felt weird. I didn't feel as engaged as I thought I would and I think that is due to how different it was from my initial mental prep at the start of the week. I am glad I was able to adjust in the race and get the win.",
        "positives": "+Had some really good water barriers.\n+Had gears I was yet to feel this season.\n-Had bad hurdles the last lap.",
        "goal": "Yes, absolutely. When race day came around it became obvious it was not a times day, but a day to compete for a win and I did that and came out with a W.",
        "turnpoint": "Not a lot of turning points that were super definitive in this one, because it was a pretty boring race for most of it. Biggest one was that I went for it with just over 200 to go and I went one more time after the last hurdle and got the win. ",
        "attitude": "8",
        "effort": "6",
        "date": 1557437882995
    },
    {
        "ID": "Charles KornoeljeHillsdale",
        "name": "Charles Kornoelje",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "Happy to be able to race considering that I couldn't run the day before. I was very timid during this race and gave up position and didn't push myself to what I was capable of. That's because I didn't know what I was capable of.",
        "positives": "I was 15 seconds from my PR after cross training for three weeks and not being able to run the day before.\nI finished well even though I was disappointed I could not PR.\n\nI was limping during the middle of the race. I was timid which was bad. I had too much left at the end.",
        "goal": "Yes, my goal was to race and do as well as I could.\nReally wanted to PR and compete better, but I just wasn't in shape to do it.",
        "turnpoint": "Started out DFL for the first lap which was a 79. Stuck on the lead pack in good position for two miles and was on 16:00 pace. The pack started to thin and Fred made a good move similar to MSU. I didn't go with him again and started to fall back and dropped some 80s. ",
        "attitude": "9",
        "effort": "9",
        "date": 1557437883058
    },
    {
        "ID": "JasonHillsdale",
        "name": "Jason",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "This was a tough race. I was mentally prepared to go out with the pack hang in there, building positives. The race opened up nicely, we just hit 73s a lot. At 3 laps in my legs started to feel it, so I initially freaked out a bit in my head, but got it together and just tucked in behind a guy to ride it out, built positives by keeping my position every lap. Then the pack started to string out a bit and I was fighting a lot to keep pace lot. 3 guys from the back. I knew if I got to the back of the pack it was going to be mentally harder, so I went to move around a few people on the backstretch. I tucked in again to just hold on. I started to go out the back, so I made hard move to stay on, but I just couldn't sustain long once I got there . The guy ahead of me made a move and suddenly I was just in no man's land. I tried to latch on to anyone coming by me including Mark, but that just put me more in the hole. Maybe I would have run faster if I hadn't tried so hard to stay with that huge front pack, but I couldn't give up the shot at fast one. I strained way too hard at half way and just blew up with 2k/Mile to go.",
        "positives": "This race was such a grind. I think that actually still sets me up well for conference because that's how it went last year. Last year everyone just went out too fast and everyone including me died. I just happened to be stronger than almost every non-calvin guy. Granted some people are faster this year, I still think with a week of recovery, I'll be able to grind it out better than them.",
        "goal": "No I set out to PR and put myself in position to do that, but it just wasn't there. The only thing to do now it take the positives and be ready to give everything at conference.",
        "turnpoint": "3 laps: Started feeling the creep very early, but reminded myself that this is for the boys\n2k: Really fighting to keep position and pace\nHalfway: Falling off the back, and giving too much to stay with",
        "attitude": "8",
        "effort": "9",
        "date": 1557437883059
    },
    {
        "ID": "Micah MeindertsmaHillsdale",
        "name": "Micah Meindertsma",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "The race was very strange. It started out with splits of 71, 74, 75, 67, and this type of pacing persisted through the race. I was able to bungee off of the back of the pack for most of the race but I did not make the decision that I needed to move up into the pack and put myself in better position. After the race I was very disappointed and frustrated. I want 15:00 so bad and I had an incredible opportunity at Hillsdale that I did not capitalize on. ",
        "positives": "I once again re engaged in the race, and I was able to experience the type of race that I will need to break 15. I however need to really work on the mental middle of the race to position myself well, this could mean 10+ seconds by the end of the race",
        "goal": "No I did not, and yes the goal was realistic. ",
        "turnpoint": "the first turning point was after the 4th lap surge that started to break up the pack, I began to float to the back and did not actively put myself in a better position. The second turning point was when I re engaged to the back of the pack and was able to bungee for the rest of the race. ",
        "attitude": "10",
        "effort": "8",
        "date": 1557437883060
    },
    {
        "ID": "Nathan KlaassenHillsdale",
        "name": "Nathan Klaassen",
        "meet": "Hillsdale",
        "event": "5000m",
        "thoughts": "Was seeded towards top of the heat with guys around 16:20s. Wanted to go under 16 for first time in 5k. Took the lead straight out of the gate again since I wanted to be able to set the pace and get into a good rhythm early with open space. After the first mile I was a couple seconds off pace. Made a little bit of a surge to get back on the pace but started to slow down at the halfway point. Still was on track for a really good price at the 3k mark but I had gone out a bit too hot and was really falling off the pace with 5 laps to go. Ended having a good finishing last lap and was 4 seconds from pr.",
        "positives": "Staying engaged even when it got tough.\nGood effort\n\nBeing more relaxed early in race.\n",
        "goal": "Wanted to go under 16. First mile was harder than expected. Opened in the lead for first 2k but was off sub 16 pace. Still was only 5 seconds off pace at 3k, but fell the pace hard in final 2k. Might've been able to have a good pr of 10-15 seconds (in 16:20-16:15 range) if I went out slower in first mile, but I was focused on the plan of going under 16.",
        "turnpoint": "With 6 laps to go I was in 2nd right behind the leader. Let one guy pass me on the outside which led to more people passing me. Then didn't fill gap.",
        "attitude": "8",
        "effort": "9",
        "date": 1557437883060
    },
    {
        "ID": "AddisonConference",
        "name": "Addison",
        "meet": "Conference",
        "event": "Steeple",
        "thoughts": "9:38.35. I gave the sucker everything. It hurts that it wasn't enough on the day to beat that Trine guy, but props to him. Fastest time in the last 2 years. Now that it's a day removed, and the fact that we won, I can take in the positives way more and help them push me to greater heights this season.",
        "positives": "-Got out well, a touch on the aggressive side like Diems said, but not over my head.\n\n-I didn't give up and fought all the way to the end.\n\n\n-The hurdles weren't very good. I don't know why I was not flowing over them, but I wasn't and it took a while to feel like I was getting over each one well and aggressively. The nerves and maybe the energy of the race had me bouncing high or stuttering for the first couple laps. After they passed me and the body started to get a little more tired, I got into a way better groove. Waters were pretty solid throughout.",
        "goal": "-Nope, I wanted 2nd.\n\n-Yep, I threw everything at this race. Prepared really well. (I tried to not overthink it like Al suggested, which seemed to work pretty well pre-race in the build up mentally, despite me being antsy in the race which got my hurdles early.) I'm always trying to come at each race with the best mentality, focus, and visualization I can so adding another race to my repertoire with a slightly different/new/nuanced approach is beneficial to my overall mindset and prep as a runner and as a man. \n\n-Yep, I had a season's best and a great step in the right direction.",
        "turnpoint": "2 Trine dudes passed me right before the k I believe. First reaction was \"oh shit\", like I'm not going that slow and I didn't think they would ever take it from me, but they did. I made sure the gap wasn't too big and that I closed it efficiently. Hindsight I probably gave O'Brien a little too much room, which made it harder to claw my way closer towards the end, but I didn't freak out and just kept plugging away.",
        "attitude": "9",
        "effort": "9",
        "date": 1557794273338
    },
    {
        "ID": "JasonConference",
        "name": "Jason",
        "meet": "Conference",
        "event": "Steeple",
        "thoughts": "I knew going in it would be a grind, but I also had to build, so the idea was to go out conservative to measure out my limited energy and drive home the last 3 laps. In hindsight, going out faster and getting that space early instead of being in traffic could have helped me a lot since I was inefficient with a lot of idiots around me who were just unpredictable what they were going to do in front and beside me to get over the barrier. I had to start fighting to stay close around 1k, I knew if I could just get to Pettinga and the Trine guy I could stick in there and score hopefully in 5th/6th.I wanted so much more. From the beginning of the season I wanted to medal at MIAAs in the steeple, but my body just never showed up for any race past Spring Break.",
        "positives": "Hurdles were 90% solid. Had one really good water barrier and a couple decent ones. Attacked it better than before. Less momentum lost. Waters and hurdles are still much better in practice than in races. Maybe I just need more races/more hurdle workouts at steeple race pace. ",
        "goal": "No, I wanted to score at least and was shooting for 4th-6th range. Looking at the season as a whole, something was just not right with my body from Spring Break onwards. I need to figure that out. An important truth about running is that you can give training and races everything, and still not achieve. The tough bit is that the only thing you can do about it is to take the positives you did have, assess if there is something better you could have done, and go after it again with confidence. You just have to believe that you'll make it happen eventually despite the evidence otherwise. Al says Bringing Attitude and Effort on a daily basis will make you a great runner, but it's a process that takes days, weeks, months, and years. ",
        "turnpoint": "First 200m: Didn't get out well because I wanted to get out conservative and build, but I quickly realized that would be a terrible idea with the amount of randos chucking their limbs everywhere, but for whatever reason everyone ran in lane 1.5 or lane 2 so I just stuck on the rail passing people until finally someone moved inside on me on the backstretch.\n\nSecond lap: Made a hard move to get behind Pettinga and the Trine guy away from trouble, the gap wasn't exactly wide enough, but at this point, I was just frustrated so it became big enough. Now that I had room it was easier to hurdle well and put ground on the field.\n\n3 laps to go - Form starts to deteriorate, just trying to hold my spot",
        "attitude": "9",
        "effort": "9",
        "date": 1557794273339
    },
    {
        "ID": "Fred McWainConference",
        "name": "Fred McWain",
        "meet": "Conference",
        "event": "5000m",
        "thoughts": "I was prepared for it.  I wanted to score,and I think I could have if I had raced for 8th place the duration of  the race, but at some point it went from kicking down people for 8th to being in the 4th-8th group and telling myself that everyone in that group was doubling and were already in pain, and if I can hurt more than them, I will score.  \nShortly after that Wittland made a move and it hurt me a lot.  When the gap formed, it wasn't anything I could actually physically cover.  I went through the mile in 4:57, 8 seconds faster than I ever have, and 3k ~9:16 (3k PR).  I put myself in a position to succeed within the race and also pretty far over the line for that last 1600.  I am not disappointed at all, I wish I could have scored, but I believe that I was sowing seeds that I WILL be up there later on and I won't go back next time.  I respected who I was around, but I was calm and at no point thought anyone in that race was straight up better than me.  \nAll of the boys cheering on kept me honest and committed and for that I had a much better race too, that is exactly what I wanted and I couldn't ask for more.",
        "positives": "(+) I was mentally complete. No mental gaps in that race.\n(+) I put myself out there and in a place for success for me and supported Noah.\n(-) I was spent with a mile to go, did not manage energy well, and dealing with the pain of it wasn't enough to score.\n(+) I firmly believe I set myself up for the future, that I held that pace through 3400m, I can make the last mile happen in due time.",
        "goal": "No.  I wanted to add to the point total of the meet.  I think it was realistic but I would need a near-perfect race to do so. I was seeded 14th in the race, was 8th going into the last 500m, finished 12th.",
        "turnpoint": "4.5 to go- I pulled up with noah and went to box in Wittland, and he responded immediately, hopped outside my trail leg and made a hard move.  I did not respond to it because I didn't see that as a smart move, and the group around me started to accelerate as well and i was pretty well spent.",
        "attitude": "10",
        "effort": "9.7",
        "date": 1557794273338
    },
    {
        "ID": "Justin VarineauConference",
        "name": "Justin Varineau",
        "meet": "Conference",
        "event": "5000m",
        "thoughts": "I'm content with this race. I'm better than fourth place in the conference, but for where I am at right now, this was a good race.\nGoing in, I was super nervous and not that confident, so that's why I rated my attitude a 7. Going forward, it'll be important to remember to not lose confidence, even when the body isn't feeling la creme de la creme.",
        "positives": "+: Being able to finish the race in another gear\n+: Making attempts to help Tyler out once he split off\n-: With that said, I wish I had fully committed to those attempts. I left Tyler all on his own for the last 6 laps of the race, and if I had gotten back up to Tyler, that would've benefited both of us.\n",
        "goal": "I think so. I competed well and did what I could with what God gave me",
        "turnpoint": "Probably when Ditri went and things started to get real. I'm mildly happy with how I reacted. I was a little surprised with how much I had left in the last lap, so I wish I would've made more of an attempt to go with Wittland, but other than that, I'm satisfied with how I stuck on Beakas and was able to finish.",
        "attitude": "7",
        "effort": "9",
        "date": 1557794273340
    },
    {
        "ID": "Caleb FergusonMIAA Conference Championships",
        "name": "Caleb Ferguson",
        "meet": "MIAA Conference Championships",
        "event": "Steeple",
        "thoughts": "I ran really stupidly. I went out too hard because I got all excited and then I died hard because I didn't have any competition.",
        "positives": "+ I won\n+ I went for it I guess.\n- I am a moron.",
        "goal": "My goal was to win and qualify. I think it was realistic but it was a perfect set up and I got over excited and went out too hard. Didn't have the focus late to make it happen when I messed up early.",
        "turnpoint": "Turning points were hard to distinguish, but I remember going out too hard and instead of just deciding that that was the pace I was going for then I slowed down to something I felt was sustainable which is a bad idea when you go out over your head. I also with a couple laps to go was not able to focus on picking up the pace and really cranking because I was losing form over hurdles and that breaks focus.",
        "attitude": "7",
        "effort": "8",
        "date": 1557794273338
    },
    {
        "ID": "Jack RandallConference Championship",
        "name": "Jack Randall",
        "meet": "Conference Championship",
        "event": "10000m",
        "thoughts": "Conference went really well. We went out butt-slow after restarting due to a false start (seriously). The first 8 laps or so were led by a scrawny kid from Hope. We clicked 80s as everyone was very content to just relax and make it a race over the last 5k. After two miles Jon got sick of pretenders staying with us and put in a little surge just to shake them, Two laps later they were gone, even though we were still only running 78s. The lead pack of about 10 guys stayed steady for another mile. I got spiked up pretty good from being in such a tight pack. Finally, Beakas (Trine) made a hard move dropping the pace to 75s. Micah and I relaxed, neither of us wanted to make that hard move and we knew that not everyone who had made it would be able to see it through. Sure enough, guys starting comeing back to us. First it was Schloff (Hope). Micah and I made quick work dispatching him even though he tried to stick. We were pretty physical, getting in his space and giving elbows until he was willing to relinquish lane one to us. As soon as he wasn't able to stick to our shoulders, he was out of the race. Next was a kid from Trine. He gave us a lot more trouble. He was a tough son of a gun and kept making what I thought would be his last struggle surge when he would fall off. He kept finding his way back though. Now with three laps to go Micah and I really took it into our final surge. Micah pulled away from me and the Trine kid, which was no surprise as he is a strong runner who's feeling good right now. Two laps later and we were in the final 400m. The Trine kid was wheezing and sounding generally miserable, but I was havinh PTSD like flashbacks to conference last year when I thought a guy was dead but he resurrected himself in the last 100m to hold me off. I allowed to the Trine kid to go around me. I was okay with him determining the pace of the last lap because it meant he would exert himself more than if he was sticking on my back. With 200m to go, I switched gears and cranked around him, getting on my toes and making myself as efficient as my body would let me. With 100m to go I had already gapped him, but I was determined to bring it home strong to the end. 50m to go, and I was closing on Miller from Trine, who I didn't know was dying so hard. I didn't quite get him, losing to him by less than a second. I finished eighth which meant that all four Calvin athletes scored.",
        "positives": "+Finished really hard\n+Scored\n-Maybe could have put myself out there more with 6 laps to go",
        "goal": "Absolutely, scored points in the 10k which ended up being our highest scoring event in a strong field.",
        "turnpoint": "A big move was made by Beakas and I decided that it was too hard for me to hang with. Micah and I then just ate people up after they started dying.",
        "attitude": "10",
        "effort": "9",
        "date": 1557794273339
    }
]